(function () {
    var quest_list = {
        "修練場（月）": {
            "弓超級": {
                "AP": 40,
                "drop_list": {
                    "英雄の証": 0.178,
                    "虚影の塵": 0.243,
                    "世界樹の種": 0.188,
                    "鳳凰の羽根": 0.196,
                    "隕蹄鉄": 0.201,
                    "血の涙石": 0.131,
                    "弓の輝石": 0.21,
                    "弓の魔石": 1.203,
                    "弓の秘石": 0.299,
                    "アーチャーピース": 0.805,
                    "アーチャーモニュメント": 0.582
                }
            },
            "弓上級": {
                "AP": 30,
                "drop_list": {
                    "英雄の証": 0.106,
                    "虚影の塵": 0.215,
                    "世界樹の種": 0.152,
                    "鳳凰の羽根": 0.086,
                    "隕蹄鉄": 0.133,
                    "血の涙石": 0.06,
                    "弓の輝石": 0.189,
                    "弓の魔石": 1.562,
                    "弓の秘石": 0.152,
                    "アーチャーピース": 1.039,
                    "アーチャーモニュメント": 0.352
                }
            },
            "弓中級": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.076,
                    "凶骨": 0.304,
                    "竜の牙": 0.012,
                    "虚影の塵": 0.136,
                    "世界樹の種": 0.145,
                    "鳳凰の羽根": 0.01,
                    "隕蹄鉄": 0.105,
                    "弓の輝石": 1.376,
                    "弓の魔石": 0.347,
                    "アーチャーピース": 0.663,
                    "アーチャーモニュメント": 0.072
                }
            },
            "弓初級": {
                "AP": 10,
                "drop_list": {
                    "英雄の証": 0.111,
                    "凶骨": 0.244,
                    "竜の牙": 0.038,
                    "虚影の塵": 0.052,
                    "隕蹄鉄": 0.051,
                    "弓の輝石": 1.356,
                    "アーチャーピース": 0.219,
                    "アーチャーモニュメント": 0.015
                }
            }
        },
        "修練場（火）": {
            "槍超級": {
                "AP": 40,
                "drop_list": {
                    "英雄の証": 0.196,
                    "虚影の塵": 0.234,
                    "世界樹の種": 0.249,
                    "鳳凰の羽根": 0.112,
                    "ホムンクルスベビー": 0.214,
                    "戦馬の幼角": 0.129,
                    "槍の輝石": 0.189,
                    "槍の魔石": 1.204,
                    "槍の秘石": 0.276,
                    "ランサーピース": 0.775,
                    "ランサーモニュメント": 0.545
                }
            },
            "槍上級": {
                "AP": 30,
                "drop_list": {
                    "英雄の証": 0.162,
                    "虚影の塵": 0.205,
                    "世界樹の種": 0.197,
                    "鳳凰の羽根": 0.089,
                    "ホムンクルスベビー": 0.18,
                    "戦馬の幼角": 0.059,
                    "槍の輝石": 0.169,
                    "槍の魔石": 1.479,
                    "槍の秘石": 0.17,
                    "ランサーピース": 0.989,
                    "ランサーモニュメント": 0.351
                }
            },
            "槍中級": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.107,
                    "凶骨": 0.165,
                    "虚影の塵": 0.136,
                    "世界樹の種": 0.123,
                    "ホムンクルスベビー": 0.087,
                    "槍の輝石": 1.162,
                    "槍の魔石": 0.663,
                    "ランサーピース": 0.712,
                    "ランサーモニュメント": 0.081
                }
            },
            "槍初級": {
                "AP": 10,
                "drop_list": {
                    "英雄の証": 0.12,
                    "凶骨": 0.266,
                    "虚影の塵": 0.064,
                    "ホムンクルスベビー": 0.042,
                    "槍の輝石": 1.162,
                    "ランサーピース": 0.223,
                    "ランサーモニュメント": 0.027
                }
            }
        },
        "修練場（水）": {
            "狂超級": {
                "AP": 40,
                "drop_list": {
                    "英雄の証": 0.238,
                    "虚影の塵": 0.236,
                    "八連双晶": 0.157,
                    "混沌の爪": 0.083,
                    "狂の輝石": 0.168,
                    "狂の魔石": 1.16,
                    "狂の秘石": 0.234,
                    "バーサーカーピース": 0.846,
                    "バーサーカーモニュメント": 0.564
                }
            },
            "狂上級": {
                "AP": 30,
                "drop_list": {
                    "英雄の証": 0.134,
                    "虚影の塵": 0.183,
                    "八連双晶": 0.134,
                    "混沌の爪": 0.09,
                    "狂の輝石": 0.143,
                    "狂の魔石": 1.328,
                    "狂の秘石": 0.141,
                    "バーサーカーピース": 1.028,
                    "バーサーカーモニュメント": 0.407
                }
            },
            "狂中級": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.064,
                    "虚影の塵": 0.186,
                    "八連双晶": 0.128,
                    "混沌の爪": 0.035,
                    "狂の輝石": 1.237,
                    "狂の魔石": 0.638,
                    "バーサーカーピース": 0.738,
                    "バーサーカーモニュメント": 0.077
                }
            },
            "狂初級": {
                "AP": 10,
                "drop_list": {
                    "英雄の証": 0.119,
                    "虚影の塵": 0.039,
                    "八連双晶": 0.054,
                    "狂の輝石": 1.323,
                    "バーサーカーピース": 0.189,
                    "バーサーカーモニュメント": 0.016
                }
            }
        },
        "修練場（木）": {
            "騎超級": {
                "AP": 40,
                "drop_list": {
                    "竜の牙": 0.467,
                    "虚影の塵": 0.168,
                    "隕蹄鉄": 0.207,
                    "竜の逆鱗": 0.075,
                    "騎の輝石": 0.231,
                    "騎の魔石": 0.936,
                    "騎の秘石": 0.409,
                    "ライダーピース": 0.774,
                    "ライダーモニュメント": 0.586
                }
            },
            "騎上級": {
                "AP": 30,
                "drop_list": {
                    "竜の牙": 0.442,
                    "虚影の塵": 0.125,
                    "隕蹄鉄": 0.151,
                    "竜の逆鱗": 0.034,
                    "騎の輝石": 0.24,
                    "騎の魔石": 1.191,
                    "騎の秘石": 0.258,
                    "ライダーピース": 1.028,
                    "ライダーモニュメント": 0.407
                }
            },
            "騎中級": {
                "AP": 20,
                "drop_list": {
                    "竜の牙": 0.255,
                    "虚影の塵": 0.148,
                    "隕蹄鉄": 0.111,
                    "騎の輝石": 0.949,
                    "騎の魔石": 0.925,
                    "ライダーピース": 0.683,
                    "ライダーモニュメント": 0.064
                }
            },
            "騎初級": {
                "AP": 10,
                "drop_list": {
                    "竜の牙": 0.166,
                    "虚影の塵": 0.03,
                    "隕蹄鉄": 0.05,
                    "騎の輝石": 1.191,
                    "ライダーピース": 0.22,
                    "ライダーモニュメント": 0.018
                }
            }
        },
        "修練場（金）": {
            "術超級": {
                "AP": 40,
                "drop_list": {
                    "虚影の塵": 0.246,
                    "蛇の宝玉": 0.249,
                    "禁断の頁": 0.207,
                    "蛮神の心臓": 0.063,
                    "術の輝石": 0.109,
                    "術の魔石": 0.903,
                    "術の秘石": 0.774,
                    "キャスターピース": 0.805,
                    "キャスターモニュメント": 0.567
                }
            },
            "術上級": {
                "AP": 30,
                "drop_list": {
                    "虚影の塵": 0.222,
                    "蛇の宝玉": 0.221,
                    "禁断の頁": 0.155,
                    "蛮神の心臓": 0.038,
                    "術の輝石": 0.046,
                    "術の魔石": 1.725,
                    "術の秘石": 0.228,
                    "キャスターピース": 0.966,
                    "キャスターモニュメント": 0.319
                }
            },
            "術中級": {
                "AP": 20,
                "drop_list": {
                    "虚影の塵": 0.215,
                    "蛇の宝玉": 0.145,
                    "禁断の頁": 0.096,
                    "術の輝石": 0.968,
                    "術の魔石": 0.787,
                    "キャスターピース": 0.832,
                    "キャスターモニュメント": 0.07
                }
            },
            "術初級": {
                "AP": 10,
                "drop_list": {
                    "虚影の塵": 0.146,
                    "蛇の宝玉": 0.081,
                    "禁断の頁": 0.048,
                    "術の輝石": 1.25,
                    "術の魔石": 0.117,
                    "キャスターピース": 0.323,
                    "キャスターモニュメント": 0.021
                }
            }
        },
        "修練場（土）": {
            "殺超級": {
                "AP": 40,
                "drop_list": {
                    "竜の牙": 0.146,
                    "虚影の塵": 0.193,
                    "世界樹の種": 0.309,
                    "ゴーストランタン": 0.19,
                    "無間の歯車": 0.007,
                    "黒獣脂": 0.121,
                    "殺の輝石": 0.16,
                    "殺の魔石": 1.186,
                    "殺の秘石": 0.258,
                    "アサシンピース": 0.808,
                    "アサシンモニュメント": 0.58
                }
            },
            "殺上級": {
                "AP": 30,
                "drop_list": {
                    "竜の牙": 0.09,
                    "虚影の塵": 0.141,
                    "世界樹の種": 0.19,
                    "ゴーストランタン": 0.159,
                    "無間の歯車": 0.18,
                    "黒獣脂": 0.059,
                    "殺の輝石": 0.162,
                    "殺の魔石": 1.477,
                    "殺の秘石": 0.144,
                    "アサシンピース": 1.02,
                    "アサシンモニュメント": 0.38
                }
            },
            "殺中級": {
                "AP": 20,
                "drop_list": {
                    "竜の牙": 0.183,
                    "虚影の塵": 0.186,
                    "世界樹の種": 0.089,
                    "ゴーストランタン": 0.018,
                    "無間の歯車": 0.101,
                    "殺の輝石": 0.83,
                    "殺の魔石": 1.083,
                    "アサシンピース": 0.693,
                    "アサシンモニュメント": 0.087
                }
            },
            "殺初級": {
                "AP": 10,
                "drop_list": {
                    "竜の牙": 0.116,
                    "虚影の塵": 0.11,
                    "ゴーストランタン": 0.029,
                    "無間の歯車": 0.094,
                    "殺の輝石": 1.314,
                    "アサシンピース": 0.28,
                    "アサシンモニュメント": 0.027
                }
            }
        },
        "修練場（日）": {
            "剣超級": {
                "AP": 40,
                "drop_list": {
                    "英雄の証": 0.194,
                    "虚影の塵": 0.231,
                    "世界樹の種": 0.269,
                    "鳳凰の羽根": 0.104,
                    "無間の歯車": 0.208,
                    "追憶の貝殻": 0.211,
                    "精霊根": 0.079,
                    "剣の輝石": 0.241,
                    "剣の魔石": 1.189,
                    "剣の秘石": 0.288,
                    "セイバーピース": 0.724,
                    "セイバーモニュメント": 0.524
                }
            },
            "剣上級": {
                "AP": 30,
                "drop_list": {
                    "英雄の証": 0.142,
                    "虚影の塵": 0.196,
                    "世界樹の種": 0.24,
                    "鳳凰の羽根": 0.17,
                    "無間の歯車": 0.143,
                    "追憶の貝殻": 0.153,
                    "精霊根": 0.037,
                    "剣の輝石": 0.258,
                    "剣の魔石": 1.345,
                    "剣の秘石": 0.052,
                    "セイバーピース": 0.997,
                    "セイバーモニュメント": 0.345
                }
            },
            "剣中級": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.101,
                    "虚影の塵": 0.161,
                    "世界樹の種": 0.117,
                    "無間の歯車": 0.1,
                    "追憶の貝殻": 0.106,
                    "剣の輝石": 1.067,
                    "剣の魔石": 0.825,
                    "セイバーピース": 0.694,
                    "セイバーモニュメント": 0.086
                }
            },
            "剣初級": {
                "AP": 10,
                "drop_list": {
                    "英雄の証": 0.112,
                    "凶骨": 0.241,
                    "竜の牙": 0.038,
                    "虚影の塵": 0.042,
                    "無間の歯車": 0.047,
                    "追憶の貝殻": 0.047,
                    "剣の輝石": 1.249,
                    "セイバーピース": 0.219,
                    "セイバーモニュメント": 0.024
                }
            }
        },
        "冬木": {
            "X-A（屋敷跡）": {
                "AP": 3,
                "drop_list": {
                    "凶骨": 0.076,
                    "剣の輝石": 0.174
                }
            },
            "X-B（爆心地）": {
                "AP": 4,
                "drop_list": {
                    "凶骨": 0.15,
                    "剣の輝石": 0.145,
                    "槍の輝石": 0.111
                }
            },
            "X-C（大橋）": {
                "AP": 4,
                "drop_list": {
                    "凶骨": 0.185,
                    "剣の輝石": 0.199,
                    "槍の輝石": 0.152
                }
            },
            "X-D（港）": {
                "AP": 5,
                "drop_list": {
                    "凶骨": 0.205,
                    "剣の輝石": 0.233,
                    "弓の輝石": 0.201
                }
            },
            "X-E（教会）": {
                "AP": 5,
                "drop_list": {
                    "凶骨": 0.18,
                    "虚影の塵": 0.042,
                    "剣の輝石": 0.187,
                    "弓の輝石": 0.103,
                    "ライダーピース": 0.051
                }
            },
            "X-F（校舎）": {
                "AP": 6,
                "drop_list": {
                    "凶骨": 0.168,
                    "虚影の塵": 0.084,
                    "剣の輝石": 0.122,
                    "弓の輝石": 0.166,
                    "ランサーピース": 0.033,
                    "アサシンピース": 0.049
                }
            },
            "X-G（燃え盛る森）": {
                "AP": 15,
                "drop_list": {
                    "凶骨": 0.642,
                    "剣の輝石": 0.101,
                    "弓の輝石": 0.05,
                    "槍の輝石": 0.202
                }
            },
            "変動座標点0号（大空洞）": {
                "AP": 7,
                "drop_list": {
                    "竜の牙": 0.092,
                    "虚影の塵": 0.076,
                    "剣の輝石": 0.016,
                    "弓の輝石": 0.059,
                    "殺の輝石": 0.189,
                    "セイバーピース": 0.076
                }
            }
        },
        "オルレアン": {
            "ドンレミ": {
                "AP": 7,
                "drop_list": {
                    "英雄の証": 0.178,
                    "剣の輝石": 0.111,
                    "槍の輝石": 0.089
                }
            },
            "ヴォークルール": {
                "AP": 7,
                "drop_list": {
                    "凶骨": 0.053,
                    "竜の牙": 0.105,
                    "剣の輝石": 0.084,
                    "騎の輝石": 0.147
                }
            },
            "ラ・シャリテ": {
                "AP": 7,
                "drop_list": {
                    "英雄の証": 0.059,
                    "竜の牙": 0.135,
                    "槍の輝石": 0.124,
                    "騎の輝石": 0.353
                }
            },
            "ジュラ": {
                "AP": 7,
                "drop_list": {
                    "竜の牙": 0.071,
                    "虚影の塵": 0.09,
                    "世界樹の種": 0.052,
                    "剣の輝石": 0.135,
                    "槍の輝石": 0.181,
                    "騎の輝石": 0.2,
                    "殺の輝石": 0.071,
                    "ライダーピース": 0.129
                }
            },
            "リヨン": {
                "AP": 7,
                "drop_list": {
                    "英雄の証": 0.201,
                    "虚影の塵": 0.058,
                    "剣の輝石": 0.221,
                    "槍の輝石": 0.117,
                    "アサシンピース": 0.144
                }
            },
            "マルセイユ": {
                "AP": 7,
                "drop_list": {
                    "英雄の証": 0.296,
                    "剣の輝石": 0.2,
                    "槍の輝石": 0.25
                }
            },
            "ティエール": {
                "AP": 7,
                "drop_list": {
                    "竜の牙": 0.162,
                    "虚影の塵": 0.09,
                    "騎の輝石": 0.426,
                    "バーサーカーピース": 0.063
                }
            },
            "ボルドー": {
                "AP": 7,
                "drop_list": {
                    "世界樹の種": 0.099,
                    "剣の輝石": 0.067,
                    "槍の輝石": 0.302,
                    "殺の輝石": 0.242
                }
            },
            "オルレアン": {
                "AP": 8,
                "drop_list": {
                    "凶骨": 0.139,
                    "竜の牙": 0.103,
                    "虚影の塵": 0.094,
                    "槍の輝石": 0.087,
                    "騎の輝石": 0.145,
                    "騎の魔石": 0.071,
                    "キャスターピース": 0.116
                }
            },
            "パリ": {
                "AP": 13,
                "drop_list": {
                    "凶骨": 0.163,
                    "竜の牙": 0.144,
                    "虚影の塵": 0.118,
                    "弓の輝石": 0.124,
                    "騎の輝石": 0.059,
                    "騎の魔石": 0.065,
                    "セイバーピース": 0.02,
                    "アーチャーピース": 0.026,
                    "ランサーピース": 0.013
                }
            }
        },
        "セプテム": {
            "アッビア街道": {
                "AP": 9,
                "drop_list": {
                    "英雄の証": 0.295,
                    "虚影の塵": 0.054,
                    "剣の輝石": 0.188,
                    "弓の輝石": 0.125,
                    "槍の輝石": 0.071,
                    "バーサーカーピース": 0.098
                }
            },
            "ローマ": {
                "AP": 9,
                "drop_list": {
                    "英雄の証": 0.2,
                    "剣の輝石": 0.24,
                    "槍の輝石": 0.133
                }
            },
            "エトナ火山": {
                "AP": 9,
                "drop_list": {
                    "ゴーストランタン": 0.103,
                    "殺の輝石": 0.313
                }
            },
            "フロレンティア": {
                "AP": 9,
                "drop_list": {
                    "英雄の証": 0.295,
                    "剣の輝石": 0.04,
                    "弓の輝石": 0.21,
                    "槍の輝石": 0.063
                }
            },
            "メディオラヌム": {
                "AP": 9,
                "drop_list": {
                    "英雄の証": 0.296,
                    "剣の輝石": 0.156,
                    "槍の輝石": 0.237
                }
            },
            "ゲルマニア": {
                "AP": 15,
                "drop_list": {
                    "凶骨": 0.537,
                    "混沌の爪": 0.026,
                    "剣の輝石": 0.135,
                    "弓の輝石": 0.051,
                    "槍の輝石": 0.103,
                    "狂の魔石": 0.08
                }
            },
            "マッシリア": {
                "AP": 9,
                "drop_list": {
                    "英雄の証": 0.139,
                    "虚影の塵": 0.185,
                    "剣の輝石": 0.066,
                    "槍の輝石": 0.099,
                    "ライダーピース": 0.086,
                    "バーサーカーピース": 0.106
                }
            },
            "ガリア": {
                "AP": 9,
                "drop_list": {
                    "英雄の証": 0.156,
                    "虚影の塵": 0.083,
                    "八連双晶": 0.068,
                    "弓の輝石": 0.092,
                    "槍の輝石": 0.139,
                    "狂の輝石": 0.153,
                    "セイバーピース": 0.092
                }
            },
            "ブリタニア": {
                "AP": 10,
                "drop_list": {
                    "世界樹の種": 0.088,
                    "剣の輝石": 0.238,
                    "槍の輝石": 0.288,
                    "殺の輝石": 0.213
                }
            },
            "形ある島": {
                "AP": 9,
                "drop_list": {
                    "凶骨": 0.206,
                    "虚影の塵": 0.059,
                    "弓の輝石": 0.118,
                    "槍の輝石": 0.029,
                    "バーサーカーピース": 0.118
                }
            },
            "連合首都": {
                "AP": 10,
                "drop_list": {
                    "英雄の証": 0.133,
                    "虚影の塵": 0.076,
                    "八連双晶": 0.019,
                    "剣の輝石": 0.038,
                    "弓の輝石": 0.133,
                    "狂の輝石": 0.101,
                    "バーサーカーピース": 0.12
                }
            }
        },
        "オケアノス": {
            "海賊船": {
                "AP": 12,
                "drop_list": {
                    "英雄の証": 0.596,
                    "剣の輝石": 0.196,
                    "弓の輝石": 0.261
                }
            },
            "海賊島": {
                "AP": 13,
                "drop_list": {
                    "英雄の証": 0.516,
                    "虚影の塵": 0.114,
                    "弓の輝石": 0.283,
                    "狂の輝石": 0.173,
                    "ライダーピース": 0.087,
                    "ライダーモニュメント": 0.024
                }
            },
            "王の住まう島": {
                "AP": 13,
                "drop_list": {
                    "英雄の証": 0.296,
                    "虚影の塵": 0.085,
                    "弓の輝石": 0.113,
                    "狂の輝石": 0.113,
                    "バーサーカーピース": 0.118,
                    "バーサーカーモニュメント": 0.02
                }
            },
            "地図に記された島": {
                "AP": 13,
                "drop_list": {
                    "竜の牙": 0.382,
                    "虚影の塵": 0.141,
                    "剣の輝石": 0.267,
                    "弓の輝石": 0.177,
                    "バーサーカーピース": 0.101,
                    "バーサーカーモニュメント": 0.017
                }
            },
            "暗礁海域": {
                "AP": 17,
                "drop_list": {
                    "凶骨": 0.361,
                    "蛇の宝玉": 0.159,
                    "弓の輝石": 0.26,
                    "術の輝石": 0.163,
                    "術の魔石": 0.222
                }
            },
            "潮目の海": {
                "AP": 14,
                "drop_list": {
                    "英雄の証": 0.252,
                    "八連双晶": 0.111,
                    "弓の輝石": 0.185,
                    "狂の輝石": 0.182,
                    "狂の魔石": 0.046
                }
            },
            "翼竜の島": {
                "AP": 14,
                "drop_list": {
                    "竜の牙": 0.503,
                    "騎の輝石": 0.422,
                    "騎の魔石": 0.059
                }
            },
            "カルデラの島": {
                "AP": 17,
                "drop_list": {
                    "世界樹の種": 0.161,
                    "隕蹄鉄": 0.129,
                    "剣の輝石": 0.383,
                    "騎の輝石": 0.354
                }
            },
            "嵐の海域": {
                "AP": 15,
                "drop_list": {
                    "ゴーストランタン": 0.222,
                    "殺の輝石": 0.511
                }
            },
            "群島（静かな入り江）": {
                "AP": 15,
                "drop_list": {
                    "英雄の証": 0.179,
                    "竜の牙": 0.119,
                    "虚影の塵": 0.226,
                    "剣の輝石": 0.31,
                    "キャスターピース": 0.131,
                    "バーサーカーピース": 0.131,
                    "キャスターモニュメント": 0.024,
                    "バーサーカーモニュメント": 0.036
                }
            },
            "群島（隠された島）": {
                "AP": 16,
                "drop_list": {
                    "追憶の貝殻": 0.28,
                    "剣の輝石": 0.493,
                    "剣の魔石": 0.038
                }
            },
            "豊かな海": {
                "AP": 18,
                "drop_list": {
                    "世界樹の種": 0.308,
                    "鳳凰の羽根": 0.093,
                    "剣の輝石": 0.164,
                    "槍の輝石": 0.227,
                    "弓の魔石": 0.097,
                    "槍の魔石": 0.051
                }
            }
        },
        "ロンドン": {
            "オールドストリート": {
                "AP": 15,
                "drop_list": {
                    "無間の歯車": 0.114,
                    "殺の輝石": 0.593
                }
            },
            "ホワイトチャペル": {
                "AP": 15,
                "drop_list": {
                    "虚影の塵": 0.071,
                    "無間の歯車": 0.132,
                    "殺の輝石": 0.432,
                    "殺の魔石": 0.041,
                    "アサシンピース": 0.082,
                    "アサシンモニュメント": 0.025
                }
            },
            "シティ・オブ・ロンドン": {
                "AP": 15,
                "drop_list": {
                    "ホムンクルスベビー": 0.118,
                    "槍の輝石": 0.604
                }
            },
            "ソーホー": {
                "AP": 16,
                "drop_list": {
                    "虚影の塵": 0.131,
                    "無間の歯車": 0.071,
                    "ホムンクルスベビー": 0.111,
                    "槍の輝石": 0.071,
                    "殺の輝石": 0.071,
                    "槍の魔石": 0.03,
                    "殺の魔石": 0.04,
                    "キャスターピース": 0.101,
                    "キャスターモニュメント": 0.01
                }
            },
            "ウェストミンスター": {
                "AP": 16,
                "drop_list": {
                    "虚影の塵": 0.16,
                    "ホムンクルスベビー": 0.13,
                    "槍の輝石": 0.29,
                    "槍の魔石": 0.06,
                    "キャスターピース": 0.15,
                    "キャスターモニュメント": 0.05
                }
            },
            "リージェントパーク": {
                "AP": 16,
                "drop_list": {
                    "無間の歯車": 0.092,
                    "禁断の頁": 0.035,
                    "剣の輝石": 0.227,
                    "術の輝石": 0.113,
                    "剣の魔石": 0.092
                }
            },
            "クラーケンウェル": {
                "AP": 18,
                "drop_list": {
                    "凶骨": 0.375,
                    "無間の歯車": 0.264,
                    "剣の輝石": 0.203,
                    "殺の輝石": 0.076,
                    "殺の魔石": 0.146,
                    "殺の秘石": 0.035
                }
            },
            "サザーク": {
                "AP": 19,
                "drop_list": {
                    "凶骨": 0.287,
                    "ホムンクルスベビー": 0.305,
                    "弓の輝石": 0.152,
                    "槍の輝石": 0.316,
                    "槍の魔石": 0.106
                }
            },
            "ハイドパーク": {
                "AP": 20,
                "drop_list": {
                    "凶骨": 0.358,
                    "禁断の頁": 0.276,
                    "槍の輝石": 0.182,
                    "術の輝石": 0.088,
                    "術の魔石": 0.152,
                    "術の秘石": 0.032
                }
            }
        },
        "北米": {
            "ブラックヒルズ": {
                "AP": 17,
                "drop_list": {
                    "無間の歯車": 0.161,
                    "弓の輝石": 0.425
                }
            },
            "リバートン": {
                "AP": 17,
                "drop_list": {
                    "英雄の証": 0.385,
                    "虚影の塵": 0.328,
                    "剣の輝石": 0.164,
                    "弓の輝石": 0.041,
                    "槍の輝石": 0.061,
                    "ランサーピース": 0.209,
                    "ランサーモニュメント": 0.078
                }
            },
            "デンバー": {
                "AP": 17,
                "drop_list": {
                    "虚影の塵": 0.137,
                    "無間の歯車": 0.151,
                    "弓の輝石": 0.266,
                    "弓の魔石": 0.094,
                    "ランサーピース": 0.137,
                    "ランサーモニュメント": 0.077
                }
            },
            "デミング": {
                "AP": 17,
                "drop_list": {
                    "竜の牙": 0.623,
                    "騎の輝石": 0.371,
                    "騎の魔石": 0.071
                }
            },
            "ダラス": {
                "AP": 17,
                "drop_list": {
                    "英雄の証": 0.679,
                    "弓の輝石": 0.102,
                    "槍の輝石": 0.256
                }
            },
            "アルカトラズ": {
                "AP": 18,
                "drop_list": {
                    "英雄の証": 0.479,
                    "虚影の塵": 0.138,
                    "剣の輝石": 0.036,
                    "槍の輝石": 0.257,
                    "バーサーカーピース": 0.108,
                    "バーサーカーモニュメント": 0.018
                }
            },
            "デモイン": {
                "AP": 18,
                "drop_list": {
                    "虚影の塵": 0.143,
                    "世界樹の種": 0.094,
                    "混沌の爪": 0.205,
                    "殺の魔石": 0.087,
                    "狂の魔石": 0.08,
                    "ランサーピース": 0.087,
                    "ランサーモニュメント": 0.05
                }
            },
            "モントゴメリー": {
                "AP": 18,
                "drop_list": {
                    "英雄の証": 0.627,
                    "虚影の塵": 0.148,
                    "弓の輝石": 0.312,
                    "アーチャーピース": 0.102,
                    "アーチャーモニュメント": 0.054
                }
            },
            "ラボック": {
                "AP": 18,
                "drop_list": {
                    "英雄の証": 0.607,
                    "黒獣脂": 0.123,
                    "剣の輝石": 0.215,
                    "弓の輝石": 0.092,
                    "殺の魔石": 0.092
                }
            },
            "アレクサンドリア": {
                "AP": 18,
                "drop_list": {
                    "英雄の証": 0.47,
                    "血の涙石": 0.116,
                    "剣の輝石": 0.102,
                    "弓の輝石": 0.041,
                    "槍の輝石": 0.092,
                    "弓の魔石": 0.063
                }
            },
            "カーニー": {
                "AP": 18,
                "drop_list": {
                    "英雄の証": 0.507,
                    "戦馬の幼角": 0.127,
                    "剣の輝石": 0.136,
                    "槍の輝石": 0.131,
                    "槍の魔石": 0.074
                }
            },
            "シャーロット": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.487,
                    "虚影の塵": 0.638,
                    "弓の輝石": 0.1,
                    "槍の輝石": 0.102,
                    "術の輝石": 0.05,
                    "ランサーピース": 0.097,
                    "バーサーカーピース": 0.278,
                    "ランサーモニュメント": 0.044,
                    "バーサーカーモニュメント": 0.12
                }
            },
            "ワシントン": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.487,
                    "精霊根": 0.077,
                    "剣の輝石": 0.126,
                    "弓の輝石": 0.053,
                    "槍の輝石": 0.044,
                    "術の輝石": 0.076,
                    "剣の秘石": 0.035
                }
            },
            "シカゴ": {
                "AP": 21,
                "drop_list": {
                    "無間の歯車": 0.408,
                    "弓の輝石": 0.227,
                    "弓の魔石": 0.163,
                    "弓の秘石": 0.04
                }
            }
        },
        "キャメロット": {
            "砂嵐の砂漠": {
                "AP": 19,
                "drop_list": {
                    "凶骨": 0.638,
                    "智慧のスカラベ": 0.08,
                    "剣の輝石": 0.102,
                    "弓の輝石": 0.096,
                    "槍の輝石": 0.106,
                    "術の秘石": 0.031
                }
            },
            "明けの砂丘": {
                "AP": 19,
                "drop_list": {
                    "蛇の宝玉": 0.115,
                    "封魔のランプ": 0.115,
                    "術の輝石": 0.163,
                    "術の魔石": 0.455
                }
            },
            "死の荒野": {
                "AP": 19,
                "drop_list": {
                    "愚者の鎖": 0.631,
                    "殺の輝石": 0.196,
                    "狂の輝石": 0.152
                }
            },
            "東の村": {
                "AP": 19,
                "drop_list": {
                    "竜の牙": 0.45,
                    "戦馬の幼角": 0.173,
                    "騎の輝石": 0.4,
                    "槍の魔石": 0.106
                }
            },
            "円卓の砦": {
                "AP": 19,
                "drop_list": {
                    "英雄の証": 0.38,
                    "大騎士勲章": 0.192,
                    "剣の輝石": 0.099,
                    "槍の輝石": 0.206,
                    "剣の魔石": 0.129,
                    "槍の魔石": 0.099
                }
            },
            "晩鐘廟": {
                "AP": 19,
                "drop_list": {
                    "ゴーストランタン": 0.329,
                    "殺の輝石": 0.484,
                    "殺の魔石": 0.026
                }
            },
            "西の村跡": {
                "AP": 20,
                "drop_list": {
                    "虚影の塵": 0.468,
                    "殺の輝石": 0.431,
                    "アサシンピース": 0.116,
                    "アサシンモニュメント": 0.029
                }
            },
            "アトラス院": {
                "AP": 20,
                "drop_list": {
                    "無間の歯車": 0.21,
                    "禁断の頁": 0.069,
                    "弓の輝石": 0.154,
                    "弓の魔石": 0.196,
                    "術の魔石": 0.167
                }
            },
            "聖都正門": {
                "AP": 20,
                "drop_list": {
                    "大騎士勲章": 0.328,
                    "剣の魔石": 0.085,
                    "弓の魔石": 0.046,
                    "槍の魔石": 0.097
                }
            },
            "聖都市街": {
                "AP": 20,
                "drop_list": {
                    "英雄の証": 0.351,
                    "八連双晶": 0.273,
                    "精霊根": 0.124,
                    "剣の輝石": 0.05,
                    "槍の輝石": 0.095,
                    "剣の秘石": 0.03,
                    "狂の秘石": 0.086
                }
            },
            "隠れ村": {
                "AP": 21,
                "drop_list": {
                    "愚者の鎖": 0.314,
                    "封魔のランプ": 0.175,
                    "殺の輝石": 0.11,
                    "狂の輝石": 0.046,
                    "術の魔石": 0.063
                }
            },
            "王城": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.168,
                    "大騎士勲章": 0.369,
                    "剣の魔石": 0.251,
                    "セイバーピース": 0.099,
                    "セイバーモニュメント": 0.049
                }
            },
            "無の大地": {
                "AP": 22,
                "drop_list": {
                    "隕蹄鉄": 0.444,
                    "弓の輝石": 0.091,
                    "騎の輝石": 0.149,
                    "騎の魔石": 0.05,
                    "殺の魔石": 0.051,
                    "弓の秘石": 0.033,
                    "騎の秘石": 0.072
                }
            },
            "大神殿": {
                "AP": 22,
                "drop_list": {
                    "愚者の鎖": 0.431,
                    "智慧のスカラベ": 0.108,
                    "殺の輝石": 0.046,
                    "狂の輝石": 0.134,
                    "術の秘石": 0.068
                }
            }
        },
        "バビロニア": {
            "廃都バビロン": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.509,
                    "騎の輝石": 0.457
                }
            },
            "北の高台": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.226,
                    "黒獣脂": 0.18,
                    "騎の輝石": 0.235,
                    "殺の魔石": 0.093
                }
            },
            "黒い杉の森": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.347,
                    "原初の産毛": 0.082,
                    "騎の輝石": 0.327,
                    "騎の魔石": 0.071
                }
            },
            "高原": {
                "AP": 20,
                "drop_list": {
                    "万死の毒針": 0.534,
                    "世界樹の種": 0.255,
                    "槍の輝石": 0.196,
                    "騎の輝石": 0.258
                }
            },
            "湿原": {
                "AP": 21,
                "drop_list": {
                    "万死の毒針": 0.391,
                    "蛇の宝玉": 0.265,
                    "槍の輝石": 0.262,
                    "弓の魔石": 0.159
                }
            },
            "ウル": {
                "AP": 21,
                "drop_list": {
                    "世界樹の種": 0.292,
                    "混沌の爪": 0.192,
                    "剣の魔石": 0.089,
                    "殺の魔石": 0.091,
                    "狂の魔石": 0.253
                }
            },
            "エリドゥ": {
                "AP": 21,
                "drop_list": {
                    "竜の牙": 0.645,
                    "騎の輝石": 0.395,
                    "騎の魔石": 0.189
                }
            },
            "観測所": {
                "AP": 21,
                "drop_list": {
                    "追憶の貝殻": 0.425,
                    "剣の輝石": 0.344,
                    "剣の魔石": 0.163
                }
            },
            "葦の原": {
                "AP": 21,
                "drop_list": {
                    "万死の毒針": 0.626,
                    "槍の輝石": 0.461
                }
            },
            "クタ": {
                "AP": 21,
                "drop_list": {
                    "ゴーストランタン": 0.387,
                    "殺の輝石": 0.331,
                    "殺の魔石": 0.13
                }
            },
            "北壁": {
                "AP": 21,
                "drop_list": {
                    "万死の毒針": 0.438,
                    "原初の産毛": 0.121,
                    "槍の輝石": 0.284,
                    "騎の魔石": 0.076
                }
            },
            "ニップル": {
                "AP": 21,
                "drop_list": {
                    "万死の毒針": 0.302,
                    "竜の逆鱗": 0.134,
                    "槍の輝石": 0.237,
                    "騎の秘石": 0.052
                }
            },
            "エビフ山": {
                "AP": 21,
                "drop_list": {
                    "世界樹の種": 0.24,
                    "呪獣胆石": 0.123,
                    "狂の魔石": 0.251,
                    "狂の秘石": 0.039
                }
            },
            "鮮血神殿": {
                "AP": 21,
                "drop_list": {
                    "世界樹の種": 0.23,
                    "原初の産毛": 0.19,
                    "騎の輝石": 0.151,
                    "騎の魔石": 0.156
                }
            }
        },
        "新宿": {
            "代々木二丁目": {
                "AP": 20,
                "drop_list": {
                    "魔術髄液": 0.366,
                    "術の輝石": 0.387
                }
            },
            "国道20号": {
                "AP": 20,
                "drop_list": {
                    "虚影の塵": 0.298,
                    "魔術髄液": 0.421,
                    "弓の輝石": 0.101,
                    "弓の魔石": 0.125
                }
            },
            "新宿駅": {
                "AP": 21,
                "drop_list": {
                    "魔術髄液": 0.654,
                    "弓の輝石": 0.202,
                    "弓の魔石": 0.243
                }
            },
            "新宿四丁目": {
                "AP": 21,
                "drop_list": {
                    "魔術髄液": 0.386,
                    "混沌の爪": 0.196,
                    "術の輝石": 0.241,
                    "狂の秘石": 0.045
                }
            },
            "歌舞伎町": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.275,
                    "無間の歯車": 0.285,
                    "殺の魔石": 0.367
                }
            },
            "バレルタワー": {
                "AP": 21,
                "drop_list": {
                    "無間の歯車": 0.459,
                    "殺の魔石": 0.429
                }
            },
            "パーティ会場": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.283,
                    "魔術髄液": 0.259,
                    "無間の歯車": 0.215,
                    "弓の輝石": 0.132,
                    "弓の魔石": 0.107,
                    "殺の魔石": 0.116
                }
            },
            "タワー最上階": {
                "AP": 21,
                "drop_list": {
                    "無間の歯車": 0.205,
                    "精霊根": 0.1,
                    "殺の魔石": 0.24,
                    "剣の秘石": 0.04
                }
            },
            "新宿御苑": {
                "AP": 21,
                "drop_list": {
                    "魔術髄液": 0.315,
                    "蛮神の心臓": 0.125,
                    "術の輝石": 0.401,
                    "術の秘石": 0.045
                }
            },
            "新宿二丁目": {
                "AP": 21,
                "drop_list": {
                    "禁断の頁": 0.313,
                    "血の涙石": 0.187,
                    "術の輝石": 0.074,
                    "弓の魔石": 0.083,
                    "術の魔石": 0.193,
                    "術の秘石": 0.032
                }
            }
        },
        "アガルタ": {
            "地底平原": {
                "AP": 20,
                "drop_list": {
                    "竜の牙": 0.419,
                    "混沌の爪": 0.211,
                    "騎の輝石": 0.301,
                    "狂の秘石": 0.05
                }
            },
            "野営地": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.326,
                    "鳳凰の羽根": 0.152,
                    "戦馬の幼角": 0.237,
                    "槍の輝石": 0.348,
                    "槍の魔石": 0.174
                }
            },
            "川辺の町": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.352,
                    "鳳凰の羽根": 0.23,
                    "剣の輝石": 0.391,
                    "剣の魔石": 0.135,
                    "剣の秘石": 0.045
                }
            },
            "桃源郷": {
                "AP": 21,
                "drop_list": {
                    "八連双晶": 0.407,
                    "狂の輝石": 0.312,
                    "狂の魔石": 0.089,
                    "狂の秘石": 0.03
                }
            },
            "イース": {
                "AP": 21,
                "drop_list": {
                    "英雄の証": 0.35,
                    "虚影の塵": 0.343,
                    "騎の輝石": 0.415
                }
            },
            "北の断崖": {
                "AP": 21,
                "drop_list": {
                    "愚者の鎖": 0.395,
                    "黒獣脂": 0.213,
                    "殺の魔石": 0.306
                }
            },
            "不夜城": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.35,
                    "愚者の鎖": 0.35,
                    "殺の魔石": 0.4
                }
            },
            "山裾の密林": {
                "AP": 21,
                "drop_list": {
                    "竜の牙": 0.502,
                    "世界樹の種": 0.15,
                    "鳳凰の羽根": 0.153,
                    "弓の輝石": 0.183,
                    "騎の輝石": 0.269,
                    "弓の魔石": 0.116,
                    "騎の魔石": 0.054
                }
            },
            "竜宮城": {
                "AP": 21,
                "drop_list": {
                    "英雄の証": 0.307,
                    "奇奇神酒": 0.127,
                    "騎の輝石": 0.271,
                    "弓の秘石": 0.048
                }
            },
            "地底大河": {
                "AP": 21,
                "drop_list": {
                    "世界樹の種": 0.26,
                    "鳳凰の羽根": 0.296,
                    "弓の輝石": 0.383,
                    "槍の魔石": 0.14,
                    "槍の秘石": 0.037
                }
            },
            "エルドラド": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.208,
                    "世界樹の種": 0.333,
                    "剣の輝石": 0.563
                }
            },
            "大地の裂け目": {
                "AP": 21,
                "drop_list": {
                    "蛇の宝玉": 0.382,
                    "術の魔石": 0.501,
                    "術の秘石": 0.037
                }
            }
        },
        "下総国": {
            "田んぼ": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.409,
                    "ゴーストランタン": 0.22,
                    "槍の輝石": 0.195,
                    "殺の輝石": 0.34
                }
            },
            "里": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.317,
                    "世界樹の種": 0.332,
                    "枯淡勾玉": 0.29,
                    "槍の輝石": 0.173,
                    "剣の魔石": 0.213
                }
            },
            "庵": {
                "AP": 21,
                "drop_list": {
                    "ゴーストランタン": 0.271,
                    "枯淡勾玉": 0.245,
                    "殺の輝石": 0.414,
                    "剣の魔石": 0.226
                }
            },
            "城下町": {
                "AP": 21,
                "drop_list": {
                    "枯淡勾玉": 0.415,
                    "剣の魔石": 0.403
                }
            },
            "合戦場": {
                "AP": 21,
                "drop_list": {
                    "凶骨": 0.398,
                    "虚影の塵": 0.301,
                    "枯淡勾玉": 0.245,
                    "剣の輝石": 0.247,
                    "剣の魔石": 0.148
                }
            },
            "土気城": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.287,
                    "枯淡勾玉": 0.27,
                    "奇奇神酒": 0.102,
                    "剣の魔石": 0.231,
                    "槍の秘石": 0.033
                }
            },
            "裏山": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.303,
                    "八連双晶": 0.247,
                    "枯淡勾玉": 0.236,
                    "剣の魔石": 0.259,
                    "狂の魔石": 0.079
                }
            },
            "荒川の原": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.295,
                    "枯淡勾玉": 0.218,
                    "呪獣胆石": 0.122,
                    "剣の魔石": 0.257,
                    "狂の秘石": 0.048
                }
            }
        },
        "セイレム": {
            "静寂な森": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.477,
                    "騎の輝石": 0.447
                }
            },
            "カーター家": {
                "AP": 20,
                "drop_list": {
                    "宵哭きの鉄杭": 0.417,
                    "蛮神の心臓": 0.119,
                    "殺の魔石": 0.246,
                    "術の秘石": 0.043
                }
            },
            "公会堂": {
                "AP": 21,
                "drop_list": {
                    "鳳凰の羽根": 0.362,
                    "術の魔石": 0.351
                }
            },
            "波止場": {
                "AP": 21,
                "drop_list": {
                    "愚者の鎖": 0.424,
                    "鳳凰の羽根": 0.204,
                    "殺の輝石": 0.253,
                    "術の魔石": 0.22
                }
            },
            "ウェイトリー家": {
                "AP": 21,
                "drop_list": {
                    "ホムンクルスベビー": 0.428,
                    "槍の輝石": 0.413,
                    "槍の魔石": 0.201
                }
            },
            "郊外の屋敷": {
                "AP": 21,
                "drop_list": {
                    "愚者の鎖": 0.426,
                    "宵哭きの鉄杭": 0.399,
                    "殺の輝石": 0.246,
                    "狂の輝石": 0.223
                }
            },
            "ガローの丘": {
                "AP": 21,
                "drop_list": {
                    "宵哭きの鉄杭": 0.697,
                    "狂の輝石": 0.362,
                    "殺の魔石": 0.154
                }
            },
            "牧草地": {
                "AP": 21,
                "drop_list": {
                    "宵哭きの鉄杭": 0.405,
                    "世界樹の種": 0.376,
                    "騎の輝石": 0.229,
                    "狂の輝石": 0.211
                }
            },
            "空き家": {
                "AP": 21,
                "drop_list": {
                    "宵哭きの鉄杭": 0.425,
                    "鳳凰の羽根": 0.209,
                    "狂の輝石": 0.239,
                    "術の魔石": 0.149
                }
            },
            "隠れ家": {
                "AP": 21,
                "drop_list": {
                    "世界樹の種": 0.503,
                    "鳳凰の羽根": 0.16,
                    "騎の輝石": 0.206,
                    "術の魔石": 0.135
                }
            },
            "留置所": {
                "AP": 21,
                "drop_list": {
                    "竜の牙": 0.415,
                    "封魔のランプ": 0.203,
                    "剣の輝石": 0.372,
                    "術の魔石": 0.084
                }
            }
        },
        "アナスタシア": {
            "アンカーポイント": {
                "AP": 20,
                "drop_list": {
                    "万死の毒針": 0.396,
                    "戦馬の幼角": 0.177,
                    "槍の輝石": 0.344,
                    "槍の魔石": 0.083
                }
            },
            "ヤガ・スモレンスク": {
                "AP": 20,
                "drop_list": {
                    "励振火薬": 0.654,
                    "剣の輝石": 0.229,
                    "殺の輝石": 0.222
                }
            },
            "風穴氷窟": {
                "AP": 20,
                "drop_list": {
                    "万死の毒針": 0.401,
                    "追憶の貝殻": 0.256,
                    "槍の輝石": 0.252,
                    "狂の輝石": 0.193
                }
            },
            "叛逆軍の砦": {
                "AP": 21,
                "drop_list": {
                    "励振火薬": 0.402,
                    "戦馬の幼角": 0.197,
                    "剣の輝石": 0.344,
                    "槍の魔石": 0.098
                }
            },
            "ヤガ・スィチョーフカ": {
                "AP": 21,
                "drop_list": {
                    "励振火薬": 0.407,
                    "世界樹の種": 0.222,
                    "弓の輝石": 0.286,
                    "狂の魔石": 0.236
                }
            },
            "焼き払われた村": {
                "AP": 21,
                "drop_list": {
                    "励振火薬": 0.395,
                    "追憶の貝殻": 0.258,
                    "剣の輝石": 0.252,
                    "狂の輝石": 0.188
                }
            },
            "ヤガ・ヴァジマ": {
                "AP": 21,
                "drop_list": {
                    "万死の毒針": 0.449,
                    "励振火薬": 0.354,
                    "槍の輝石": 0.189,
                    "殺の輝石": 0.188
                }
            },
            "ヤガ・ジェメンスク": {
                "AP": 21,
                "drop_list": {
                    "永遠結氷": 0.225,
                    "戦馬の幼角": 0.155,
                    "槍の魔石": 0.099,
                    "殺の魔石": 0.394
                }
            },
            "ヤガ・トゥーラ": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.296,
                    "励振火薬": 0.297,
                    "永遠結氷": 0.22,
                    "弓の輝石": 0.141,
                    "殺の魔石": 0.257
                }
            },
            "潰れた村": {
                "AP": 21,
                "drop_list": {
                    "追憶の貝殻": 0.258,
                    "永遠結氷": 0.258,
                    "狂の輝石": 0.212,
                    "殺の魔石": 0.28
                }
            },
            "ヤガ・モスクワ": {
                "AP": 21,
                "drop_list": {
                    "永遠結氷": 0.461,
                    "殺の魔石": 0.456
                }
            },
            "大渓谷の砦": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.301,
                    "励振火薬": 0.312,
                    "奇奇神酒": 0.108,
                    "殺の輝石": 0.273,
                    "殺の秘石": 0.055
                }
            },
            "大樹の根元": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.303,
                    "万死の毒針": 0.312,
                    "永遠結氷": 0.178,
                    "殺の魔石": 0.197
                }
            },
            "ヤガ・リャザン": {
                "AP": 21,
                "drop_list": {
                    "永遠結氷": 0.277,
                    "混沌の爪": 0.225,
                    "殺の魔石": 0.29,
                    "狂の秘石": 0.028
                }
            }
        },
        "ゲッテルデメルング": {
            "ランディングポイント": {
                "AP": 20,
                "drop_list": {
                    "虚影の塵": 0.389,
                    "世界樹の種": 0.175,
                    "原初の産毛": 0.127,
                    "殺の輝石": 0.516,
                    "殺の魔石": 0.079
                }
            },
            "薄氷の丘": {
                "AP": 20,
                "drop_list": {
                    "世界樹の種": 0.25,
                    "巨人の指輪": 0.297,
                    "殺の輝石": 0.323,
                    "狂の魔石": 0.255
                }
            },
            "巨人の花園": {
                "AP": 20,
                "drop_list": {
                    "巨人の指輪": 0.407,
                    "狂の魔石": 0.454
                }
            },
            "第23集落": {
                "AP": 21,
                "drop_list": {
                    "世界樹の種": 0.324,
                    "オーロラ鋼": 0.234,
                    "殺の輝石": 0.269,
                    "騎の魔石": 0.179
                }
            },
            "英雄の穴倉": {
                "AP": 21,
                "drop_list": {
                    "八連双晶": 0.272,
                    "巨人の指輪": 0.255,
                    "狂の魔石": 0.335,
                    "狂の秘石": 0.032
                }
            },
            "雪と氷の城": {
                "AP": 21,
                "drop_list": {
                    "オーロラ鋼": 0.391,
                    "騎の魔石": 0.463
                }
            },
            "果てへと至る道": {
                "AP": 21,
                "drop_list": {
                    "巨人の指輪": 0.188,
                    "原初の産毛": 0.188,
                    "殺の魔石": 0.08,
                    "狂の魔石": 0.339
                }
            },
            "炎の館": {
                "AP": 21,
                "drop_list": {
                    "巨人の指輪": 0.26,
                    "オーロラ鋼": 0.248,
                    "騎の魔石": 0.238,
                    "狂の魔石": 0.218
                }
            },
            "第67集落": {
                "AP": 21,
                "drop_list": {
                    "オーロラ鋼": 0.262,
                    "原初の産毛": 0.164,
                    "騎の魔石": 0.304,
                    "殺の魔石": 0.072
                }
            },
            "北の境界": {
                "AP": 21,
                "drop_list": {
                    "虚影の塵": 0.334,
                    "巨人の指輪": 0.238,
                    "狂の魔石": 0.45
                }
            },
            "忘れられた神殿": {
                "AP": 21,
                "drop_list": {
                    "オーロラ鋼": 0.232,
                    "精霊根": 0.105,
                    "騎の魔石": 0.366,
                    "剣の秘石": 0.038
                }
            }
        }
    };
    
    var quest_type = {
        "曜日クエスト": ["修練場（日）", "修練場（月）", "修練場（火）", "修練場（水）", "修練場（木）", "修練場（金）", "修練場（土）"],
        "フリークエスト": ["冬木", "オルレアン", "セプテム", "ロンドン", "北米", "キャメロット", "バビロニア",
            "新宿", "アガルタ", "下総国", "セイレム",
            "アナスタシア", "ゲッテルデメルング"]
    };

    var item_list = {
        "stone": {
            "bronze": [
              "剣の輝石",
              "弓の輝石",
              "槍の輝石",
              "騎の輝石",
              "術の輝石",
              "殺の輝石",
              "狂の輝石"
            ],
            "silver": [
              "剣の魔石",
              "弓の魔石",
              "槍の魔石",
              "騎の魔石",
              "術の魔石",
              "殺の魔石",
              "狂の魔石"
            ],
            "golden": [
              "剣の秘石",
              "弓の秘石",
              "槍の秘石",
              "騎の秘石",
              "術の秘石",
              "殺の秘石",
              "狂の秘石"
            ]
        },
        "chess": {
            "silver": [
              "セイバーピース",
              "アーチャーピース",
              "ランサーピース",
              "ライダーピース",
              "キャスターピース",
              "アサシンピース",
              "バーサーカーピース"
            ],
            "golden": [
              "セイバーモニュメント",
              "アーチャーモニュメント",
              "ランサーモニュメント",
              "ライダーモニュメント",
              "キャスターモニュメント",
              "アサシンモニュメント",
              "バーサーカーモニュメント"
            ]
        },
        "other": {
            "bronze": [
              "英雄の証",
              "凶骨",
              "竜の牙",
              "虚影の塵",
              "愚者の鎖",
              "万死の毒針",
              "魔術髄液",
              "宵哭きの鉄杭",
              "励振火薬"
            ],
            "silver": [
              "世界樹の種",
              "ゴーストランタン",
              "八連双晶",
              "蛇の宝玉",
              "鳳凰の羽根",
              "無間の歯車",
              "禁断の頁",
              "ホムンクルスベビー",
              "隕蹄鉄",
              "大騎士勲章",
              "追憶の貝殻",
              "枯淡勾玉",
              "永遠結氷",
              "巨人の指輪",
              "オーロラ鋼"
            ],
            "golden": [
              "混沌の爪",
              "蛮神の心臓",
              "竜の逆鱗",
              "精霊根",
              "戦馬の幼角",
              "血の涙石",
              "黒獣脂",
              "封魔のランプ",
              "智慧のスカラベ",
              "原初の産毛",
              "呪獣胆石",
              "奇奇神酒"
            ]
        }
    };

    /* 資料整合 */
    var quest_info = {
        list: quest_list,
        type: quest_type
    };
    
    
    FGO.info_manager.set_quest_info(quest_info);
    FGO.info_manager.set_item_list(item_list);
    //FGO.quest_manager.set_event_list(event_list);

    var language_data = {
        "修練場（月）": {
            "CN": "修炼场（周一）",
            "TW": "修煉場（週一）",
            "EN": "Traing Ground (Monday)"
        },
        "弓超級": {
            "CN": "弓超级",
            "TW": "弓超級",
            "EN": "Archer, Novice"
        },
        "弓上級": {
            "CN": "弓上级",
            "TW": "弓上級",
            "EN": "Archer, Intermediate"
        },
        "弓中級": {
            "CN": "弓中级",
            "TW": "弓中級",
            "EN": "Archer, Advanced"
        },
        "弓初級": {
            "CN": "弓初级",
            "TW": "弓初級",
            "EN": "Archer, Expert"
        },
        "修練場（火）": {
            "CN": "修炼场（周二）",
            "TW": "修煉場（週二）",
            "EN": "Traing Ground (Tuesday)"
        },
        "槍超級": {
            "CN": "枪超级",
            "TW": "槍超級",
            "EN": "Lancer, Novice"
        },
        "槍上級": {
            "CN": "枪上级",
            "TW": "槍上級",
            "EN": "Lancer, Intermediate"
        },
        "槍中級": {
            "CN": "枪中级",
            "TW": "槍中級",
            "EN": "Lancer, Advanced"
        },
        "槍初級": {
            "CN": "枪初级",
            "TW": "槍初級",
            "EN": "Lancer, Expert"
        },
        "修練場（水）": {
            "CN": "修炼场（周三）",
            "TW": "修煉場（週三）",
            "EN": "Traing Ground (Wednesday)"
        },
        "狂超級": {
            "CN": "狂超级",
            "TW": "狂超級",
            "EN": "Berserker, Novice"
        },
        "狂上級": {
            "CN": "狂上级",
            "TW": "狂上級",
            "EN": "Berserker, Intermediate"
        },
        "狂中級": {
            "CN": "狂中级",
            "TW": "狂中級",
            "EN": "Berserker, Advanced"
        },
        "狂初級": {
            "CN": "狂初级",
            "TW": "狂初級",
            "EN": "Berserker, Expert"
        },
        "修練場（木）": {
            "CN": "修炼场（周四）",
            "TW": "修煉場（週四）",
            "EN": "Traing Ground (Thursday)"
        },
        "騎超級": {
            "CN": "骑超级",
            "TW": "騎超級",
            "EN": "Rider, Novice"
        },
        "騎上級": {
            "CN": "骑上级",
            "TW": "騎上級",
            "EN": "Rider, Intermediate"
        },
        "騎中級": {
            "CN": "骑中级",
            "TW": "騎中級",
            "EN": "Rider, Advanced"
        },
        "騎初級": {
            "CN": "骑初级",
            "TW": "騎初級",
            "EN": "Rider, Expert"
        },
        "修練場（金）": {
            "CN": "修炼场（周五）",
            "TW": "修煉場（週五）",
            "EN": "Traing Ground (Friday)"
        },
        "術超級": {
            "CN": "术超级",
            "TW": "術超級",
            "EN": "Caster, Novice"
        },
        "術上級": {
            "CN": "术上级",
            "TW": "術上級",
            "EN": "Caster, Intermediate"
        },
        "術中級": {
            "CN": "术中级",
            "TW": "術中級",
            "EN": "Caster, Advanced"
        },
        "術初級": {
            "CN": "术初级",
            "TW": "術初級",
            "EN": "Caster, Expert"
        },
        "修練場（土）": {
            "CN": "修炼场（周六）",
            "TW": "修煉場（週六）",
            "EN": "Traing Ground (Saturday)"
        },
        "殺超級": {
            "CN": "杀超级",
            "TW": "殺超級",
            "EN": "Assasin, Novice"
        },
        "殺上級": {
            "CN": "杀上级",
            "TW": "殺上級",
            "EN": "Assasin, Intermediate"
        },
        "殺中級": {
            "CN": "杀中级",
            "TW": "殺中級",
            "EN": "Assasin, Advanced"
        },
        "殺初級": {
            "CN": "杀初级",
            "TW": "殺初級",
            "EN": "Assasin, Expert"
        },
        "修練場（日）": {
            "CN": "修炼场（周日）",
            "TW": "修煉場（周日）",
            "EN": "Traing Ground (Sunday)"
        },
        "剣超級": {
            "CN": "剑超级",
            "TW": "劍超級",
            "EN": "Saber, Novice"
        },
        "剣上級": {
            "CN": "剑上级",
            "TW": "劍上級",
            "EN": "Saber, Intermediate"
        },
        "剣中級": {
            "CN": "剑中级",
            "TW": "劍中級",
            "EN": "Saber, Advanced"
        },
        "剣初級": {
            "CN": "剑初级",
            "TW": "劍初級",
            "EN": "Saber, Expert"
        },
        "冬木": {
            "CN": "冬木",
            "TW": "冬木",
            "EN": "Fuyuki"
        },
        "X-A（屋敷跡）": {
            "CN": "X-A（宅邸残迹）",
            "TW": "X-A（宅邸殘跡）",
            "EN": "X-A (The Residential Ruin)"
        },
        "X-B（爆心地）": {
            "CN": "X-B（爆炸中心地）",
            "TW": "X-B（爆炸中心地）",
            "EN": "X-B (Ground Zero)"
        },
        "X-C（大橋）": {
            "CN": "X-C（大桥）",
            "TW": "X-C（大橋）",
            "EN": "X-C (Giant Bridge)"
        },
        "X-D（港）": {
            "CN": "X-D（鲜红港口）",
            "TW": "X-D（鮮紅港口）",
            "EN": "X-D (Blood Soaken Port)"
        },
        "X-E（教会）": {
            "CN": "X-E（骸骨彷徨的教会）",
            "TW": "X-E（骸骨彷徨的教會）",
            "EN": "X-E (Church of Wandering Corpses)"
        },
        "X-F（校舎）": {
            "CN": "X-F（烧尽崩塌的校舍）",
            "TW": "X-F（燒盡崩塌的校舍）",
            "EN": "X-F (Burnt-Down Schoolhouse)"
        },
        "X-G（燃え盛る森）": {
            "CN": "X-G（熊熊燃烧的森林）",
            "TW": "X-G（熊熊燃燒的森林）",
            "EN": "X-G (Burning Forest)"
        },
        "変動座標点0号（大空洞）": {
            "CN": "变动坐标点0号（大空洞）",
            "TW": "變動座標點0號（大空洞）",
            "EN": "Mobile Coordinate No.0 (Massive Cavern)"
        },
        "オルレアン": {
            "CN": "奥尔良",
            "TW": "奧爾良",
            "EN": "Orleans"
        },
        "ドンレミ": {
            "CN": "栋雷米",
            "TW": "棟雷米",
            "EN": "Domremy"
        },
        "ヴォークルール": {
            "CN": "沃库勒尔",
            "TW": "沃庫勒爾",
            "EN": "Vaucouleurs"
        },
        "ラ・シャリテ": {
            "CN": "拉沙里泰",
            "TW": "拉沙裡泰",
            "EN": "La Charite"
        },
        "ジュラ": {
            "CN": "汝拉",
            "TW": "汝拉",
            "EN": "Jura"
        },
        "リヨン": {
            "CN": "里昂",
            "TW": "里昂",
            "EN": "Lyon"
        },
        "マルセイユ": {
            "CN": "马赛",
            "TW": "馬賽",
            "EN": "Marseilles"
        },
        "ティエール": {
            "CN": "蒂耶尔",
            "TW": "蒂耶爾",
            "EN": "Thiers"
        },
        "ボルドー": {
            "CN": "波尔多",
            "TW": "波爾多",
            "EN": "Bordeaux"
        },
        "パリ": {
            "CN": "巴黎",
            "TW": "巴黎",
            "EN": "Paris"
        },
        "セプテム": {
            "CN": "七丘之城",
            "TW": "七丘之城",
            "EN": "Septem"
        },
        "アッビア街道": {
            "CN": "亚壁街道",
            "TW": "亞壁街道",
            "EN": "Appia Road"
        },
        "ローマ": {
            "CN": "罗马",
            "TW": "羅馬",
            "EN": "Rome"
        },
        "エトナ火山": {
            "CN": "埃特纳火山",
            "TW": "埃特納火山",
            "EN": "Mt. Etna"
        },
        "フロレンティア": {
            "CN": "佛罗伦萨",
            "TW": "佛羅倫斯",
            "EN": "Florence"
        },
        "メディオラヌム": {
            "CN": "梅迪奥兰",
            "TW": "梅迪奧蘭",
            "EN": "Mediolanum"
        },
        "ゲルマニア": {
            "CN": "日耳曼尼亚",
            "TW": "日爾曼尼亞",
            "EN": "Germania"
        },
        "マッシリア": {
            "CN": "玛西格利亚",
            "TW": "瑪西格利亞",
            "EN": "Massilia"
        },
        "ガリア": {
            "CN": "高卢",
            "TW": "高盧",
            "EN": "Gaul"
        },
        "ブリタニア": {
            "CN": "不列颠尼亚",
            "TW": "不列顛尼亞",
            "EN": "Britannia"
        },
        "形ある島": {
            "CN": "有形之岛",
            "TW": "有形之島",
            "EN": "Shaped Isle"
        },
        "連合首都": {
            "CN": "联军首都",
            "TW": "聯軍首都",
            "EN": "Alliance Capital"
        },
        "オケアノス": {
            "CN": "俄刻阿诺斯",
            "TW": "俄刻阿諾斯",
            "EN": "Okeanos"
        },
        "海賊船": {
            "CN": "海盗船",
            "TW": "海盜船",
            "EN": "Pirate Ship"
        },
        "海賊島": {
            "CN": "海盗岛",
            "TW": "海盜島",
            "EN": "Pirate Island"
        },
        "王の住まう島": {
            "CN": "王者的居岛",
            "TW": "王者的居島",
            "EN": "King's Abode Island"
        },
        "地図に記された島": {
            "CN": "地图上标记的岛",
            "TW": "地圖上標記的島",
            "EN": "Mapped Island"
        },
        "暗礁海域": {
            "CN": "暗礁海域",
            "TW": "暗礁海域",
            "EN": "Sunken Rock Seas"
        },
        "潮目の海": {
            "CN": "潮眼之海",
            "TW": "潮眼之海",
            "EN": "Two-Current Sea"
        },
        "翼竜の島": {
            "CN": "翼龙之岛",
            "TW": "翼龍之島",
            "EN": "Island of Wyverns"
        },
        "カルデラの島": {
            "CN": "火山臼之岛",
            "TW": "火山臼之島",
            "EN": "Caldera Island"
        },
        "嵐の海域": {
            "CN": "暴风雨海域",
            "TW": "暴風雨海域",
            "EN": "Stormy Seas"
        },
        "群島（静かな入り江）": {
            "CN": "群岛（寂静的入海口）",
            "TW": "群島（寂靜的入海口）",
            "EN": "Archipelago (Quiet Bay)"
        },
        "群島（隠された島）": {
            "CN": "群岛（隐秘之岛）",
            "TW": "群島（隱秘之島）",
            "EN": "Archipelago (Hidden Island)"
        },
        "豊かな海": {
            "CN": "丰硕之海",
            "TW": "豐碩之海",
            "EN": "Bountiful Sea"
        },
        "ロンドン": {
            "CN": "伦敦",
            "TW": "倫敦",
            "EN": "London"
        },
        "オールドストリート": {
            "CN": "旧街",
            "TW": "舊街",
            "EN": "Old Street"
        },
        "ホワイトチャペル": {
            "CN": "白色教堂",
            "TW": "白色教堂",
            "EN": "White Chapel"
        },
        "シティ・オブ・ロンドン": {
            "CN": "伦敦城",
            "TW": "倫敦城",
            "EN": "City of London"
        },
        "ソーホー": {
            "CN": "苏活区",
            "TW": "蘇活區",
            "EN": "Soho"
        },
        "ウェストミンスター": {
            "CN": "威斯敏斯特",
            "TW": "威斯敏斯特",
            "EN": "Westminster"
        },
        "リージェントパーク": {
            "CN": "摄政公园",
            "TW": "攝政公園",
            "EN": "Regent Park"
        },
        "クラーケンウェル": {
            "CN": "克勒肯维尔",
            "TW": "克勒肯維爾",
            "EN": "Clerkenwell"
        },
        "サザーク": {
            "CN": "萨瑟克",
            "TW": "薩瑟克",
            "EN": "Southwark"
        },
        "ハイドパーク": {
            "CN": "海德公园",
            "TW": "海德公園",
            "EN": "Hyde Park"
        },
        "北米": {
            "CN": "合众为一",
            "TW": "合眾為一",
            "EN": "America"
        },
        "ブラックヒルズ": {
            "CN": "布拉克山",
            "TW": "布拉克山",
            "EN": "Black Hills"
        },
        "リバートン": {
            "CN": "里弗顿",
            "TW": "里弗敦",
            "EN": "Riverton"
        },
        "デンバー": {
            "CN": "丹佛",
            "TW": "丹佛",
            "EN": "Denver"
        },
        "デミング": {
            "CN": "德明",
            "TW": "德明",
            "EN": "Deming"
        },
        "ダラス": {
            "CN": "达拉斯",
            "TW": "達拉斯",
            "EN": "Dallas"
        },
        "アルカトラズ": {
            "CN": "阿尔卡特拉斯岛",
            "TW": "阿爾卡特拉斯島",
            "EN": "Alcatraz"
        },
        "デモイン": {
            "CN": "得梅因",
            "TW": "得梅因",
            "EN": "Des Moines"
        },
        "モントゴメリー": {
            "CN": "蒙哥马利",
            "TW": "蒙哥馬利",
            "EN": "Montgomery"
        },
        "ラボック": {
            "CN": "拉伯克",
            "TW": "拉伯克",
            "EN": "Lubbock"
        },
        "アレクサンドリア": {
            "CN": "亚历山德里亚",
            "TW": "亞歷山德里亞",
            "EN": "Alexandria"
        },
        "カーニー": {
            "CN": "卡尼",
            "TW": "卡尼",
            "EN": "Kearney"
        },
        "シャーロット": {
            "CN": "夏洛特",
            "TW": "夏洛特",
            "EN": "Charlotte"
        },
        "ワシントン": {
            "CN": "华盛顿",
            "TW": "華盛頓",
            "EN": "Washington"
        },
        "シカゴ": {
            "CN": "芝加哥",
            "TW": "芝加哥",
            "EN": "Chicago"
        },
        "キャメロット": {
            "CN": "卡美洛",
            "TW": "卡美洛",
            "EN": "Camelot"
        },
        "砂嵐の砂漠": {
            "CN": "沙尘暴的沙漠",
            "TW": "沙塵暴的沙漠",
            "EN": "Desert Sandstorm"
        },
        "明けの砂丘": {
            "CN": "黎明的沙丘",
            "TW": "黎明的沙丘",
            "EN": "Dune of Dawn"
        },
        "死の荒野": {
            "CN": "死之荒野",
            "TW": "死之荒野",
            "EN": "Wastelands of Death"
        },
        "東の村": {
            "CN": "东之村",
            "TW": "東之村",
            "EN": "East Village"
        },
        "円卓の砦": {
            "CN": "圆桌要塞",
            "TW": "圓桌要塞",
            "EN": "Fortress of the Round Table"
        },
        "晩鐘廟": {
            "CN": "晚钟庙",
            "TW": "晚鐘廟",
            "EN": "Evening Bell Mausoleum"
        },
        "西の村跡": {
            "CN": "西之村遗迹",
            "TW": "西之村遺跡",
            "EN": "West Village Ruins"
        },
        "アトラス院": {
            "CN": "阿特拉斯院",
            "TW": "阿特拉斯院",
            "EN": "Atlas Academy"
        },
        "聖都正門": {
            "CN": "圣都正门",
            "TW": "聖都正門",
            "EN": "Holy City Main Gates"
        },
        "聖都市街": {
            "CN": "圣都市街",
            "TW": "聖都市街",
            "EN": "Holy City District"
        },
        "隠れ村": {
            "CN": "隐秘之村",
            "TW": "隱秘之村",
            "EN": "Hidden Village"
        },
        "王城": {
            "CN": "王城",
            "TW": "王城",
            "EN": "Royal Castle"
        },
        "無の大地": {
            "CN": "无之大地",
            "TW": "無之大地",
            "EN": "Vast Land of Emptiness"
        },
        "大神殿": {
            "CN": "大神殿",
            "TW": "大神殿",
            "EN": "Great Temple"
        },
        "バビロニア": {
            "CN": "巴比伦尼亚",
            "TW": "巴比倫尼亞",
            "EN": "Badylonia"
        },
        "廃都バビロン": {
            "CN": "废都巴比伦",
            "TW": "廢都巴比倫",
            "EN": "Abandoned City Babylon"
        },
        "北の高台": {
            "CN": "北之高台",
            "TW": "北之高臺",
            "EN": "Northern Hill"
        },
        "黒い杉の森": {
            "CN": "黑色杉木林",
            "TW": "黑色杉木林",
            "EN": "Black Cedar Forest"
        },
        "高原": {
            "CN": "高原",
            "TW": "高原",
            "EN": "Plateau"
        },
        "湿原": {
            "CN": "湿地",
            "TW": "濕地",
            "EN": "Marshland"
        },
        "ウル": {
            "CN": "乌尔",
            "TW": "烏爾",
            "EN": "Ur"
        },
        "エリドゥ": {
            "CN": "埃里都",
            "TW": "埃裡都",
            "EN": "Eridu"
        },
        "観測所": {
            "CN": "观测所",
            "TW": "觀測所",
            "EN": "Observatory"
        },
        "葦の原": {
            "CN": "芦苇原",
            "TW": "蘆葦原",
            "EN": "Reed Fields"
        },
        "クタ": {
            "CN": "库撒",
            "TW": "庫撒",
            "EN": "Cuthah"
        },
        "北壁": {
            "CN": "北壁",
            "TW": "北壁",
            "EN": "North Wall"
        },
        "ニップル": {
            "CN": "尼普尔",
            "TW": "尼普爾",
            "EN": "Nippur"
        },
        "エビフ山": {
            "CN": "艾比夫山",
            "TW": "艾比夫山",
            "EN": "Mount Ebih"
        },
        "鮮血神殿": {
            "CN": "鲜血神殿",
            "TW": "鮮血神殿",
            "EN": "Temple of Fresh Blood"
        },
        "新宿": {
            "CN": "新宿",
            "TW": "新宿",
            "EN": "Shinjuku"
        },
        "代々木二丁目": {
            "CN": "代代木二丁目",
            "TW": "代代木二丁目",
            "EN": "Yoyogi 2-Choume"
        },
        "国道20号": {
            "CN": "国道20号",
            "TW": "國道20號",
            "EN": "National Highway 20"
        },
        "新宿駅": {
            "CN": "新宿站",
            "TW": "新宿站",
            "EN": "Shinjuku Station"
        },
        "新宿四丁目": {
            "CN": "新宿四丁目",
            "TW": "新宿四丁目",
            "EN": "Shinjuku 4-Choume"
        },
        "歌舞伎町": {
            "CN": "歌舞伎町",
            "TW": "歌舞伎町",
            "EN": "Kabukicho"
        },
        "バレルタワー": {
            "CN": "枪身塔",
            "TW": "槍身塔",
            "EN": "Barrel Tower"
        },
        "パーティ会場": {
            "CN": "舞会会场",
            "TW": "舞會會場",
            "EN": "Party Venue"
        },
        "タワー最上階": {
            "CN": "塔顶楼",
            "TW": "塔頂樓",
            "EN": "Tower Top Floor"
        },
        "新宿御苑": {
            "CN": "新宿御苑",
            "TW": "新宿御苑",
            "EN": "Shinjuku Imperial Garden"
        },
        "新宿二丁目": {
            "CN": "新宿二丁目",
            "TW": "新宿二丁目",
            "EN": "Shinjuku 2-Choume"
        },
        "アガルタ": {
            "CN": "　",
            "TW": "　",
            "EN": "Agartha"
        },
        "地底平原": {
            "CN": "　",
            "TW": "　",
            "EN": "Subterranean Plain"
        },
        "野営地": {
            "CN": "　",
            "TW": "　",
            "EN": "Campsite"
        },
        "川辺の町": {
            "CN": "　",
            "TW": "　",
            "EN": "Riverside Town"
        },
        "桃源郷": {
            "CN": "　",
            "TW": "　",
            "EN": "Peach Blossom Village"
        },
        "イース": {
            "CN": "　",
            "TW": "　",
            "EN": "Ys"
        },
        "北の断崖": {
            "CN": "　",
            "TW": "　",
            "EN": "Northern Cliff"
        },
        "不夜城": {
            "CN": "　",
            "TW": "　",
            "EN": "Fuyajo"
        },
        "山裾の密林": {
            "CN": "　",
            "TW": "　",
            "EN": "Jungle at the Foothills"
        },
        "竜宮城": {
            "CN": "　",
            "TW": "　",
            "EN": "Dragon Imperial Palace"
        },
        "地底大河": {
            "CN": "　",
            "TW": "　",
            "EN": "Subterranean River"
        },
        "エルドラド": {
            "CN": "　",
            "TW": "　",
            "EN": "El Dorado"
        },
        "大地の裂け目": {
            "CN": "　",
            "TW": "　",
            "EN": "Fissure of the Land"
        },
        "下総国": {
            "CN": "　",
            "TW": "　",
            "EN": "Shimousa"
        },
        "田んぼ": {
            "CN": "　",
            "TW": "　",
            "EN": "Farm"
        },
        "里": {
            "CN": "　",
            "TW": "　",
            "EN": "Village"
        },
        "庵": {
            "CN": "　",
            "TW": "　",
            "EN": "Hermitage"
        },
        "城下町": {
            "CN": "　",
            "TW": "　",
            "EN": "Castle Town"
        },
        "合戦場": {
            "CN": "　",
            "TW": "　",
            "EN": "Battlefield"
        },
        "土気城": {
            "CN": "　",
            "TW": "　",
            "EN": "Toke Castle"
        },
        "裏山": {
            "CN": "　",
            "TW": "　",
            "EN": "Mountain Behind"
        },
        "荒川の原": {
            "CN": "　",
            "TW": "　",
            "EN": "Arakawa Plains"
        },
        "セイレム": {
            "CN": "　",
            "TW": "　",
            "EN": "Salem"
        },
        "静寂な森": {
            "CN": "　",
            "TW": "　",
            "EN": "Silent Forest"
        },
        "カーター家": {
            "CN": "　",
            "TW": "　",
            "EN": "Carter Residence"
        },
        "公会堂": {
            "CN": "　",
            "TW": "　",
            "EN": "Public Chapel"
        },
        "波止場": {
            "CN": "　",
            "TW": "　",
            "EN": "Wharf"
        },
        "ウェイトリー家": {
            "CN": "　",
            "TW": "　",
            "EN": "Whateley Residence"
        },
        "郊外の屋敷": {
            "CN": "　",
            "TW": "　",
            "EN": "Suburban Mansion"
        },
        "ガローの丘": {
            "CN": "　",
            "TW": "　",
            "EN": "Gallows Hill"
        },
        "牧草地": {
            "CN": "　",
            "TW": "　",
            "EN": "Grassland"
        },
        "空き家": {
            "CN": "　",
            "TW": "　",
            "EN": "Empty Residence"
        },
        "隠れ家": {
            "CN": "　",
            "TW": "　",
            "EN": "Refuge"
        },
        "留置所": {
            "CN": "　",
            "TW": "　",
            "EN": "Jailhouse"
        },
        "アナスタシア": {
            "CN": "　",
            "TW": "　",
            "EN": "Anastasia"
        },
        "アンカーポイント": {
            "CN": "　",
            "TW": "　",
            "EN": "Anchor Point"
        },
        "ヤガ・スモレンスク": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Smolensk"
        },
        "風穴氷窟": {
            "CN": "　",
            "TW": "　",
            "EN": "Ice Cavern"
        },
        "叛逆軍の砦": {
            "CN": "　",
            "TW": "　",
            "EN": "Rebel Stronghold"
        },
        "ヤガ・スィチョーフカ": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Sychyovka"
        },
        "焼き払われた村": {
            "CN": "　",
            "TW": "　",
            "EN": "Burnt-Down Village"
        },
        "ヤガ・ヴァジマ": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Vyazma"
        },
        "ヤガ・ジェメンスク": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Demensk"
        },
        "ヤガ・トゥーラ": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Tula"
        },
        "潰れた村": {
            "CN": "　",
            "TW": "　",
            "EN": "Destroyed Village"
        },
        "ヤガ・モスクワ": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Moskva"
        },
        "大渓谷の砦": {
            "CN": "　",
            "TW": "　",
            "EN": "Great Valley Fortress"
        },
        "大樹の根元": {
            "CN": "　",
            "TW": "　",
            "EN": "Giant Tree Base"
        },
        "ヤガ・リャザン": {
            "CN": "　",
            "TW": "　",
            "EN": "Yaga Ryazan"
        },
        "ゲッテルデメルング": {
            "CN": "　",
            "TW": "　",
            "EN": "Goetterdaemmerung"
        },
        "ランディングポイント": {
            "CN": "　",
            "TW": "　",
            "EN": "Landing Point"
        },
        "薄氷の丘": {
            "CN": "　",
            "TW": "　",
            "EN": "Hill of Thin Ice"
        },
        "巨人の花園": {
            "CN": "　",
            "TW": "　",
            "EN": "Flower Garden of Giants"
        },
        "第23集落": {
            "CN": "　",
            "TW": "　",
            "EN": "23rd Settlement"
        },
        "英雄の穴倉": {
            "CN": "　",
            "TW": "　",
            "EN": "Cave of Heroes"
        },
        "雪と氷の城": {
            "CN": "　",
            "TW": "　",
            "EN": "Fortress of Ice and Snow"
        },
        "果てへと至る道": {
            "CN": "　",
            "TW": "　",
            "EN": "Path Towards the Border"
        },
        "炎の館": {
            "CN": "　",
            "TW": "　",
            "EN": "Castle of Flames"
        },
        "第67集落": {
            "CN": "　",
            "TW": "　",
            "EN": "67th Settlement"
        },
        "北の境界": {
            "CN": "　",
            "TW": "　",
            "EN": "North Boundary"
        },
        "忘れられた神殿": {
            "CN": "　",
            "TW": "　",
            "EN": "Forgotten Temple"
        },
        "銅素材": {
            "CN": "铜素材",
            "TW": "銅素材",
            "EN": "Bronze Material"
        },
        "英雄の証": {
            "CN": "英雄之证",
            "TW": "英雄之證",
            "EN": "Proof of Hero"
        },
        "凶骨": {
            "CN": "凶骨",
            "TW": "兇骨",
            "EN": "Evil Bone"
        },
        "竜の牙": {
            "CN": "龙牙",
            "TW": "龍之牙",
            "EN": "Dragon Fang"
        },
        "虚影の塵": {
            "CN": "虚影之尘",
            "TW": "虛影之塵",
            "EN": "Void's Dust"
        },
        "愚者の鎖": {
            "CN": "愚者之锁",
            "TW": "愚者之鎖",
            "EN": "Chain of Fools"
        },
        "万死の毒針": {
            "CN": "万死的毒针",
            "TW": "萬死的毒針",
            "EN": "Deadly Poison Stinger"
        },
        "魔術髄液": {
            "CN": "　",
            "TW": "　",
            "EN": "Magic Cerebrospinal Fluid"
        },
        "宵哭きの鉄杭": {
            "CN": "　",
            "TW": "　",
            "EN": "Iron Stake of Evening Tears"
        },
        "励振火薬": {
            "CN": "　",
            "TW": "　",
            "EN": "Reactive Gunpowder"
        },
        "銀素材": {
            "CN": "银素材",
            "TW": "銀素材",
            "EN": "Silver Material"
        },
        "世界樹の種": {
            "CN": "世界树之种",
            "TW": "世界樹之種",
            "EN": "Seed of Yggdrassil"
        },
        "ゴーストランタン": {
            "CN": "幽灵鬼灯",
            "TW": "鬼魂提燈",
            "EN": "Ghost Lantern"
        },
        "八連双晶": {
            "CN": "八连双晶",
            "TW": "八連雙晶",
            "EN": "Octuplet Crystals"
        },
        "蛇の宝玉": {
            "CN": "蛇之宝玉",
            "TW": "蛇之寶玉",
            "EN": "Serpent Jewel"
        },
        "鳳凰の羽根": {
            "CN": "凤凰羽毛",
            "TW": "鳳凰羽毛",
            "EN": "Phoenix Feather"
        },
        "無間の歯車": {
            "CN": "无间齿轮",
            "TW": "無間齒輪",
            "EN": "Eternal Gear"
        },
        "禁断の頁": {
            "CN": "禁断书页",
            "TW": "禁斷書頁",
            "EN": "Forbidden Page"
        },
        "ホムンクルスベビー": {
            "CN": "血瓶",
            "TW": "人工生命體幼體",
            "EN": "Homunculus Baby"
        },
        "隕蹄鉄": {
            "CN": "陨蹄铁",
            "TW": "隕蹄鐵",
            "EN": "Meteor Horseshoe"
        },
        "大騎士勲章": {
            "CN": "大骑士勋章",
            "TW": "大騎士勳章",
            "EN": "Great Knight Medal"
        },
        "追憶の貝殻": {
            "CN": "追忆的贝壳",
            "TW": "追憶的貝殼",
            "EN": "Shell of Recollection"
        },
        "枯淡勾玉": {
            "CN": "　",
            "TW": "　",
            "EN": "Kotan Magatama"
        },
        "永遠結氷": {
            "CN": "　",
            "TW": "　",
            "EN": "Eternal Frost"
        },
        "巨人の指輪": {
            "CN": "　",
            "TW": "　",
            "EN": "Ring of Giants"
        },
        "オーロラ鋼": {
            "CN": "　",
            "TW": "　",
            "EN": "Aurora Steel"
        },
        "金素材": {
            "CN": "金素材",
            "TW": "金素材",
            "EN": "Gold Material"
        },
        "混沌の爪": {
            "CN": "混沌之爪",
            "TW": "混沌之爪",
            "EN": "Claw of Chaos"
        },
        "蛮神の心臓": {
            "CN": "蛮神的心脏",
            "TW": "蠻神心臟",
            "EN": "Heart of the Foreign God"
        },
        "竜の逆鱗": {
            "CN": "龙之逆鳞",
            "TW": "龍之逆鱗",
            "EN": "Dragon's Reverse Scale"
        },
        "精霊根": {
            "CN": "精灵根",
            "TW": "精靈根",
            "EN": "Spirit Root"
        },
        "戦馬の幼角": {
            "CN": "战马的幼角",
            "TW": "戰馬的幼角",
            "EN": "Warhorse's Young Horn"
        },
        "血の涙石": {
            "CN": "血泪之石",
            "TW": "血之淚石",
            "EN": "Tearstone of Blood"
        },
        "黒獣脂": {
            "CN": "黑兽脂",
            "TW": "黑獸脂",
            "EN": "Black Beast Grease"
        },
        "封魔のランプ": {
            "CN": "封魔之灯",
            "TW": "封魔之燈",
            "EN": "Lamp of Sealed Evil"
        },
        "智慧のスカラベ": {
            "CN": "智慧的甲壳虫雕像",
            "TW": "智慧之聖甲蟲像",
            "EN": "Scarab of Wisdom"
        },
        "原初の産毛": {
            "CN": "起源的胎毛",
            "TW": "起源的胎毛",
            "EN": "Primordial Lanugo"
        },
        "呪獣胆石": {
            "CN": "咒兽的胆石",
            "TW": "咒獸膽石",
            "EN": "Cursed Beast Gallstone"
        },
        "奇奇神酒": {
            "CN": "　",
            "TW": "　",
            "EN": "Chichi Divine Wine"
        },
        "輝石": {
            "CN": "辉石",
            "TW": "輝石",
            "EN": "Gem"
        },
        "剣の輝石": {
            "CN": "剑辉石",
            "TW": "劍之輝石",
            "EN": "Gem of Saber"
        },
        "弓の輝石": {
            "CN": "弓辉石",
            "TW": "弓之輝石",
            "EN": "Gem of Archer"
        },
        "槍の輝石": {
            "CN": "枪辉石",
            "TW": "槍之輝石",
            "EN": "Gem of Lancer"
        },
        "騎の輝石": {
            "CN": "骑辉石",
            "TW": "騎之輝石",
            "EN": "Gem of Rider"
        },
        "術の輝石": {
            "CN": "术辉石",
            "TW": "術之輝石",
            "EN": "Gem of Caster"
        },
        "殺の輝石": {
            "CN": "杀辉石",
            "TW": "殺之輝石",
            "EN": "Gem of Assassin"
        },
        "狂の輝石": {
            "CN": "狂辉石",
            "TW": "狂之輝石",
            "EN": "Gem of Berserker"
        },
        "魔石": {
            "CN": "魔石",
            "TW": "魔石",
            "EN": "Magic"
        },
        "剣の魔石": {
            "CN": "剑魔石",
            "TW": "劍之魔石",
            "EN": "Magic of Saber"
        },
        "弓の魔石": {
            "CN": "弓魔石",
            "TW": "弓之魔石",
            "EN": "Magic of Archer"
        },
        "槍の魔石": {
            "CN": "枪魔石",
            "TW": "槍之魔石",
            "EN": "Magic of Lancer"
        },
        "騎の魔石": {
            "CN": "骑魔石",
            "TW": "騎之魔石",
            "EN": "Magic of Rider"
        },
        "術の魔石": {
            "CN": "术魔石",
            "TW": "術之魔石",
            "EN": "Magic of Caster"
        },
        "殺の魔石": {
            "CN": "杀魔石",
            "TW": "殺之魔石",
            "EN": "Magic of Assassin"
        },
        "狂の魔石": {
            "CN": "狂魔石",
            "TW": "狂之魔石",
            "EN": "Magic of Berserker"
        },
        "秘石": {
            "CN": "秘石",
            "TW": "秘石",
            "EN": "Secret"
        },
        "剣の秘石": {
            "CN": "剑秘石",
            "TW": "劍之秘石",
            "EN": "Secret of Saber"
        },
        "弓の秘石": {
            "CN": "弓秘石",
            "TW": "弓之秘石",
            "EN": "Secret of Archer"
        },
        "槍の秘石": {
            "CN": "枪秘石",
            "TW": "槍之秘石",
            "EN": "Secret of Lancer"
        },
        "騎の秘石": {
            "CN": "骑秘石",
            "TW": "騎之秘石",
            "EN": "Secret of Rider"
        },
        "術の秘石": {
            "CN": "术秘石",
            "TW": "術之秘石",
            "EN": "Secret of Caster"
        },
        "殺の秘石": {
            "CN": "杀秘石",
            "TW": "殺之秘石",
            "EN": "Secret of Assassin"
        },
        "狂の秘石": {
            "CN": "狂秘石",
            "TW": "狂之秘石",
            "EN": "Secret of Berserker"
        },
        "ピース": {
            "CN": "银棋",
            "TW": "銀棋",
            "EN": "Piece"
        },
        "セイバーピース": {
            "CN": "银剑棋",
            "TW": "劍階銀棋",
            "EN": "Saber Piece"
        },
        "アーチャーピース": {
            "CN": "银弓棋",
            "TW": "弓階銀棋",
            "EN": "Archer Piece"
        },
        "ランサーピース": {
            "CN": "银枪棋",
            "TW": "槍階銀棋",
            "EN": "Lancer Piece"
        },
        "ライダーピース": {
            "CN": "银骑棋",
            "TW": "騎階銀棋",
            "EN": "Rider Piece"
        },
        "キャスターピース": {
            "CN": "银术棋",
            "TW": "術階銀棋",
            "EN": "Caster Piece"
        },
        "アサシンピース": {
            "CN": "银杀棋",
            "TW": "殺階銀棋",
            "EN": "Assassin Piece"
        },
        "バーサーカーピース": {
            "CN": "银狂棋",
            "TW": "狂階銀棋",
            "EN": "Berserker Piece"
        },
        "モニュ": {
            "CN": "金棋",
            "TW": "金棋",
            "EN": "Monument"
        },
        "セイバーモニュメント": {
            "CN": "金剑棋",
            "TW": "劍階金像",
            "EN": "Saber Monument"
        },
        "アーチャーモニュメント": {
            "CN": "金弓棋",
            "TW": "弓階金像",
            "EN": "Archer Monument"
        },
        "ランサーモニュメント": {
            "CN": "金枪棋",
            "TW": "槍階金像",
            "EN": "Lancer Monument"
        },
        "ライダーモニュメント": {
            "CN": "金骑棋",
            "TW": "騎階金像",
            "EN": "Rider Monument"
        },
        "キャスターモニュメント": {
            "CN": "金术棋",
            "TW": "術階金像",
            "EN": "Caster Monument"
        },
        "アサシンモニュメント": {
            "CN": "金杀棋",
            "TW": "殺階金像",
            "EN": "Assassin Monument"
        },
        "バーサーカーモニュメント": {
            "CN": "金狂棋",
            "TW": "狂階金像",
            "EN": "Berserker Monument"
        },
        "セーブ": {
            "CN": "存档",
            "TW": "存檔",
            "EN": "Save"
        },
        "ロード": {
            "CN": "读档",
            "TW": "讀檔",
            "EN": "Load"
        },
        "計算": {
            "CN": "计算",
            "TW": "計算",
            "EN": "Calculate"
        },
        "イベント(消費AP 50%DOWN)": {
            "CN": "活动(AP減半)",
            "TW": "活動(AP減半)",
            "EN": "Event(AP COSTS 50% OFF)"
        },
        "進行度": {
            "CN": "进度",
            "TW": "進度",
            "EN": "Stage"
        },
        "曜日クエスト": {
            "CN": "每日任务",
            "TW": "每日任務",
            "EN": "Summary"
        },
        "フリークエスト": {
            "CN": "自由任务",
            "TW": "自由任務",
            "EN": "Free Quest"
        },
        "コンフィグ": {
            "CN": "使用者设定",
            "TW": "使用者設定",
            "EN": "User Setting"
        },
        "結果": {
            "CN": "结果",
            "TW": "結果",
            "EN": "Result"
        },
        "エリア": {
            "CN": "区域",
            "TW": "區域",
            "EN": "Stage"
        },
        "クエスト": {
            "CN": "关卡",
            "TW": "關卡",
            "EN": "Quest"
        },
        "ドロップ率": {
            "CN": "掉率",
            "TW": "掉落率",
            "EN": "Drop Rate"
        },
        "ドロップ率 / AP": {
            "CN": "掉率 / AP",
            "TW": "掉落率 / AP",
            "EN": "Drop Rate / AP"
        },
        "アイテム": {
            "CN": "物品",
            "TW": "物品",
            "EN": "Item"
        },
        "数量": {
            "CN": "数量",
            "TW": "數量",
            "EN": "Count"
        },
        "言語": {
            "CN": "语言",
            "TW": "語言",
            "EN": "Language"
        },
        "ただいま計算中": {
            "CN": "计算中",
            "TW": "計算中",
            "EN": "Calculating"
        },
        "タイムズ": {
            "CN": "次数",
            "TW": "次數",
            "EN": "Times"
        },
        "リセット": {
            "CN": "重置",
            "TW": "重置",
            "EN": "Reset"
        }
    };
    if (FGO.language_manager) {
        FGO.language_manager.set_data_base(language_data);
    }
})();

