var every_day_data = {
    "週日 劍之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "劍之輝石": 126.03,
                "英雄之證": 14.5,
                "虛影之塵": 5.33,
                "無間齒輪": 4.75,
                "龍之牙": 4.5,
                "兇骨": 23.5,
                "劍階銀棋": 21.67,
                "劍階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "劍之輝石": 99.56,
                "劍之魔石": 64.16,
                "世界樹之種": 13.92,
                "英雄之證": 14,
                "虛影之塵": 14.67,
                "無間齒輪": 10.17,
                "劍階銀棋": 68.33,
                "劍階金像": 7.17
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "劍之輝石": 30.17,
                "劍之魔石": 122.49,
                "劍之秘石": 1.33,
                "鳳凰羽毛": 18,
                "世界樹之種": 29.67,
                "英雄之證": 16.5,
                "虛影之塵": 22.5,
                "無間齒輪": 15.33,
                "劍階銀棋": 104.16,
                "劍階金像": 35
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "劍之輝石": 32.17,
                "劍之魔石": 113.33,
                "劍之秘石": 24.33,
                "鳳凰羽毛": 13,
                "世界樹之種": 35.33,
                "英雄之證": 21.5,
                "虛影之塵": 27.33,
                "無間齒輪": 25,
                "劍階銀棋": 77,
                "劍階金像": 55.33
            }
        },
    },
    "週一 弓之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "弓之輝石": 133.63,
                "英雄之證": 9.17,
                "虛影之塵": 5.33,
                "龍之牙": 3.67,
                "隕蹄鐵": 4.93,
                "兇骨": 23.67,
                "弓階銀棋": 21.67,
                "弓階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "弓之輝石": 136.32,
                "弓之魔石": 38.33,
                "鳳凰羽毛": 0.67,
                "世界樹之種": 13.83,
                "英雄之證": 7.33,
                "虛影之塵": 14.67,
                "龍之牙": 0.67,
                "隕蹄鐵": 10.33,
                "兇骨": 30.33,
                "弓階銀棋": 68.33,
                "弓階金像": 7.17
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "弓之輝石": 19.17,
                "弓之魔石": 154.43,
                "弓之秘石": 13.67,
                "鳳凰羽毛": 10.17,
                "世界樹之種": 14.5,
                "英雄之證": 13.5,
                "虛影之塵": 22,
                "隕蹄鐵": 14.98,
                "弓階銀棋": 108.33,
                "弓階金像": 35.33
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "弓之輝石": 19,
                "弓之魔石": 130.5,
                "弓之秘石": 28.4,
                "鳳凰羽毛": 20.5,
                "世界樹之種": 19.75,
                "英雄之證": 18.5,
                "虛影之塵": 24,
                "隕蹄鐵": 22.5,
                "弓階銀棋": 81.66,
                "弓階金像": 57.66
            }
        },
    },
    "週二 槍之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "槍之輝石": 117.5,
                "英雄之證": 13.02,
                "虛影之塵": 5.33,
                "人工生命體幼體": 5,
                "兇骨": 27,
                "槍階銀棋": 21.67,
                "槍階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "槍之輝石": 114.66,
                "槍之魔石": 62.66,
                "世界樹之種": 12,
                "英雄之證": 6.8,
                "虛影之塵": 14.67,
                "人工生命體幼體": 10.33,
                "兇骨": 16.86,
                "槍階銀棋": 68.33,
                "槍階金像": 7.17
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "槍之輝石": 18.33,
                "槍之魔石": 154.43,
                "槍之秘石": 11,
                "鳳凰羽毛": 8.67,
                "世界樹之種": 20.5,
                "英雄之證": 13.5,
                "虛影之塵": 22,
                "人工生命體幼體": 15.73,
                "槍階銀棋": 103.33,
                "槍階金像": 35.33
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "槍之輝石": 19.13,
                "槍之魔石": 129,
                "槍之秘石": 23.66,
                "鳳凰羽毛": 13.33,
                "世界樹之種": 26.5,
                "英雄之證": 18.5,
                "虛影之塵": 27.33,
                "人工生命體幼體": 23.67,
                "槍階銀棋": 80,
                "槍階金像": 57
            }
        },
    },
    "週三 狂之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "狂之輝石": 136.67,
                "英雄之證": 10,
                "虛影之塵": 3.8,
                "八連雙晶": 5.53,
                "狂階銀棋": 18.33,
                "狂階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "狂之輝石": 129.08,
                "狂之魔石": 61.25,
                "英雄之證": 6.5,
                "虛影之塵": 17.12,
                "混沌之爪": 3,
                "八連雙晶": 11.78,
                "狂階銀棋": 66.42,
                "狂階金像": 7.83
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "狂之輝石": 18.33,
                "狂之魔石": 154.43,
                "狂之秘石": 11,
                "英雄之證": 14.75,
                "虛影之塵": 22.5,
                "混沌之爪": 6,
                "八連雙晶": 12.07,
                "狂階銀棋": 109.17,
                "狂階金像": 38.67
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "狂之輝石": 18,
                "狂之魔石": 116,
                "狂之秘石": 24,
                "英雄之證": 22.17,
                "虛影之塵": 22.67,
                "混沌之爪": 9,
                "八連雙晶": 15.17,
                "狂階銀棋": 86.67,
                "狂階金像": 56.33
            }
        },
    },
    "週四 騎之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "騎之輝石": 112.12,
                "虛影之塵": 5.33,
                "龍之牙": 17.17,
                "隕蹄鐵": 4.95,
                "騎階銀棋": 21.67,
                "騎階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "騎之輝石": 91.33,
                "騎之魔石": 92.41,
                "虛影之塵": 14.67,
                "龍之牙": 28.75,
                "隕蹄鐵": 10.33,
                "騎階銀棋": 68.33,
                "騎階金像": 7.17
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "騎之輝石": 23.18,
                "騎之魔石": 121.08,
                "騎之秘石": 23.67,
                "虛影之塵": 13.5,
                "龍之逆鱗": 3,
                "龍之牙": 46.22,
                "隕蹄鐵": 14.5,
                "騎階銀棋": 104.17,
                "騎階金像": 37.33
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "騎之輝石": 19.8,
                "騎之魔石": 99.33,
                "騎之秘石": 38.66,
                "虛影之塵":16,
                "龍之逆鱗": 8,
                "龍之牙": 47.2,
                "隕蹄鐵": 18.75,
                "騎階銀棋": 80,
                "騎階金像": 59
            }
        },
    },
    "週五 術之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "術之輝石": 122.67,
                "術之魔石": 10.9,
                "虛影之塵": 13.33,
                "蛇之寶玉": 7.42,
                "禁斷書頁": 5,
                "術階銀棋": 31.67,
                "術階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "術之輝石": 95.67,
                "術之魔石": 76.67,
                "虛影之塵": 22,
                "蛇之寶玉": 14,
                "禁斷書頁": 10,
                "術階銀棋": 82.5,
                "術階金像": 6.25
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "術之輝石": 4.53,
                "術之魔石": 169.89,
                "術之秘石": 24,
                "虛影之塵": 20.53,
                "蛇之寶玉": 21.77,
                "禁斷書頁": 15.75,
                "蠻神心臟": 4,
                "術階銀棋": 94.5,
                "術階金像": 31.8
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "術之輝石": 9.25,
                "術之魔石": 89.86,
                "術之秘石": 79.5,
                "虛影之塵": 24.67,
                "蛇之寶玉": 24.86,
                "禁斷書頁": 21.15,
                "蠻神心臟": 6,
                "術階銀棋": 82.08,
                "術階金像": 56.58
            }
        },
    },
    "週六 殺之修鍊場": {
        "初級": {
            AP: 10,
            drop: {
                "殺之輝石": 131.33,
                "虛影之塵": 10.67,
                "鬼魂提燈": 3.33,
                "無間齒輪": 5.2,
                "龍之牙": 12.67,
                "殺階銀棋": 28.33,
                "殺階金像": 2
            }
        },
        "中級": {
            AP: 20,
            drop: {
                "殺之輝石": 82.59,
                "殺之魔石": 108.06,
                "世界樹之種": 8.67,
                "虛影之塵": 16,
                "鬼魂提燈": 2.83,
                "無間齒輪": 10,
                "龍之牙": 17.67,
                "殺階銀棋": 68.33,
                "殺階金像": 7.83
            }
        },
        "上級": {
            AP: 30,
            drop: {
                "殺之輝石": 16.4,
                "殺之魔石": 140.65,
                "殺之秘石": 13.33,
                "世界樹之種": 16.5,
                "虛影之塵": 16,
                "鬼魂提燈": 16.42,
                "無間齒輪": 15.47,
                "龍之牙": 11,
                "殺階銀棋": 103.33,
                "殺階金像": 36
            }
        },
        "超級": {
            AP: 40,
            drop: {
                "殺之輝石": 16.67,
                "殺之魔石": 109.82,
                "殺之秘石": 25,
                "世界樹之種": 31.16,
                "虛影之塵": 19.33,
                "鬼魂提燈": 18.8,
                "無間齒輪": 0.67,
                "龍之牙": 14.33,
                "殺階銀棋": 80,
                "殺階金像": 57.67
            }
        },
    },
};
    
//item2 > 混沌之爪~
//item3 > 劍弓槍~殺
var drop_data = {
    /* 所屬           區域          AP              英雄之證    |   凶骨      |   龍之牙     |   虛影之塵    |   愚者之鎖    |   世界樹之種   |   鬼魂提燈    |   八連雙晶    |   蛇之寶玉    |   鳳凰羽毛    |   無間齒輪    |   禁斷書頁    |   人工生命體幼體 |   隕蹄鐵     |   大騎士勳章   |   追憶的貝殼   |   混沌之爪    |   蠻神心臟    |   龍之逆鱗    |   精靈根     |   戰馬的幼角   |   血之淚石    |   黑獸脂     |   封魔之燈    |   智慧之聖甲蟲像 */
    "特異點F": {
        "未確認座標X-A": { "宅邸殘跡": { AP: 3, item: [0, 0.075] } },
        "未確認座標X-B": { "爆炸中心地": { AP: 4, item: [0, 0.125], item3: [0.15, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0] } },
        "未確認座標X-C": { "大橋": { AP: 4, item: [0, 0.18], item3: [0.2] } },
        "未確認座標X-D": { "鮮紅港口": { AP: 5, item: [0, 0.21], item3: [0.2, 0, 0, 0.2, 0, 0, 0.15] } },
        "未確認座標X-E": { "骸骨徬徨的教會": { AP: 5, item: [0, 0.16], item3: [0.2, 0, 0, 0.1], item4: [0, 0, 0, 0, 0, 0, 0.05] } },
        "未確認座標X-F": { "燒盡崩塌地校舍": { AP: 6, item: [0, 0.17], item3: [0.15, 0, 0, 0.15], item4: [0, 0, 0, 0, 0, 0.05, 0, 0, 0.05] } },
        "未確認座標X-G": { "熊熊燃燒的森林": { AP: 15, item: [0, 0.63], item3: [0.1, 0, 0, 0.05, 0, 0, 0.2], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04] } },
        "變動座標點0號": { "大空洞": { AP: 7, item: [0, 0, 0.11, 0.08], item3: [0.05, 0, 0, 0.05, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.2], item4: [0, 0, 0, 0.1, ] } }
    },
    "第一特異點": {
        "棟雷米": { "貞德誕生地": { AP: 7, item: [0.21], item3: [0.25, 0, 0, 0, 0, 0, 0.1] } },
        "沃庫勒爾": { "起始的堡壘": { AP: 7, item: [0, 0.6, 0.8], item3: [0.1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.2] } },
        "拉沙里泰": { "盧瓦爾河畔": { AP: 7, item: [0.06, 0, 0.13], item3: [0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0.33] } },
        "汝拉": { "太古之森": { AP: 7, item: [0, 0, 0.06, 0.08, 0, 0.05], item3: [0.16, 0, 0, 0, 0, 0, 0.16, 0, 0, 0.16, 0, 0, 0, 0, 0, 0.08], item4: [0, 0, 0, 0, 0, 0, 0.1, ] } },
        "里昂": { "死者之城": { AP: 7, item: [0.21, 0, 0, 0.08], item3: [0.25, 0, 0, 0, 0, 0, 0, 0, 0], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0.1] } },
        "蒂耶爾": { "刃物之鎮": { AP: 7, item: [0, 0, 0.13, 0.08], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.33], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.1] } },
        "奧爾良": { "命運的堡壘": { AP: 8, item: [0, 0.12, 0.11, 0.08], item3: [0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0.16, 0.05], item4: [0, 0, 0, 0, 0, 0, 0, 0.1] } },
        "巴黎": { "藝術之都": { AP: 13, item: [0, 0.18, 0.09, 0.08], item3: [0, 0, 0, 0.15, 0, 0, 0, 0, 0, 0.1, 0.05], item4: [0, 0, 0, 0.02, 0.02, 0.02] } }
    },
    "第二特異點": {
        "馬賽": { "毗領地中海": { AP: 7, item: [0.3], item3: [0.2, 0, 0, 0, 0, 0, 0.25] } },
        "波爾多": { "美酒, 乾杯": { AP: 7, item: [0, 0, 0, 0, 0, 0.09], item3: [0.08, 0, 0, 0, 0, 0, 0.32, 0, 0, 0, 0, 0, 0, 0, 0, 0.24] } },
        "亞壁街道": { "街道女王": { AP: 9, item: [0.36, 0, 0, 0.08], item3: [0.15, 0, 0, 0.15, 0, 0, 0.1], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.1] } },
        "羅馬": { "羅馬非一日建成": { AP: 9, item: [0.24], item3: [0.25, 0, 0, 0, 0, 0, 0.32] } },
        "佛羅倫薩": { "花之都": { AP: 9, item: [0.3], item3: [0.05, 0, 0, 0.3, 0, 0, 0.1] } },
        "梅迪奧蘭": { "平原中心": { AP: 9, item: [0.33], item3: [0.15, 0, 0, 0, 0, 0, 0.2] } },
        "瑪西格利亞": { "遠古的港口": { AP: 9, item: [0.12, 0, 0, 0.16], item3: [0.1, 0, 0, 0, 0, 0, 0.1], item4: [0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0.1] } },
        "高盧": { "燃燒的戰火": { AP: 9, item: [0.15, 0, 0, 0.08, 0, 0, 0, 0.05], item3: [0, 0, 0, 0.1, 0, 0, 0.15], item4: [0.15, 0, 0, 0.1] } },
        "有形之島": { "女神的洞窟": { AP: 9, item: [0, 0.21, 0, 0.08], item3: [0, 0, 0, 0.25, 0, 0, 0.05], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.1] } },
        "聯軍首都": { "羅馬的地平線": { AP: 10, item: [0.18, 0, 0, 0.08, 0, 0, 0, 0.022], item3: [0.05, 0, 0, 0.1], item4: [0.13, 0, 0, 0, 0, 0, 0, 0, 0, 0.1] } },
        "埃特納火山": { "沸騰的大地": { AP: 9, item: [0, 0, 0, 0, 0, 0, 0.08], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.35] } },
        "不列顛尼亞": { "濃霧深邃之森": { AP: 10, item: [0, 0, 0, 0, 0, 0.11], item3: [0.24, 0, 0, 0, 0, 0, 0.24, 0, 0, 0, 0, 0, 0, 0, 0, 0.16] } },
        "日耳曼尼亞": { "黑森林": { AP: 15, item: [0, 0.45], item2: [0.03], item3: [0.05, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0, 0, ], item4: [0, 0.08] } }
    },
    "第三特異點": {
        "海盜船": { "私掠船團": { AP: 12, item: [0.57], item3: [0.2, 0, 0, 0.25] } },
        "海盜島": { "海盜大本營": { AP: 13, item: [0.54, 0, 0, 0.12], item3: [0, 0, 0, 0.25], item4: [0.15, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.02] } },
        "亡者的居島": { "被詛咒的海盜們": { AP: 13, item: [0.3, 0, 0, 0.12], item3: [0, 0, 0, 0.15], item4: [0.1, 0, 0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.02] } },
        "地圖上標記的島": { "公牛迷宮": { AP: 13, item: [0, 0, 0.36, 0.12], item3: [0.25, 0, 0, 0.15], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.02] } },
        "潮眼之海": { "自由的海原": { AP: 14, item: [0.27, 0, 0, 0, 0, 0, 0, 0.114], item3: [0, 0, 0, 0.2], item4: [0.18, 0.05] } },
        "翼龍之島": { "龍群的樂園": { AP: 14, item: [0, 0, 0.48], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.44, 0.05] } },
        "暴風雨海域": { "徬徨的幽靈船": { AP: 15, item: [0, 0, 0, 0, 0, 0, 0.225], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.49] } },
        "群島": {
            "寂靜的入海口": { AP: 15, item: [0.18, 0, 0.12, 0.24], item3: [0.3], item4: [0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0.1, 0, 0, 0, 0, 0.02, 0, 0.02] },
            "隠された島": { AP: 16, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.24], item3: [0.46, 0.05, ] }
        },
        "暗礁海域": { "船舶墳墓": { AP: 17, item: [0, 0.36, 0, 0, 0, 0, 0, 0, 0.135], item3: [0, 0, 0, 0.25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.15, 0.23] } },
        "火山臼之島": { "無人發現的島嶼": { AP: 17, item: [0, 0, 0, 0, 0, 0.15, 0, 0, 0, 0, 0, 0, 0, 0.12], item3: [0.4, 0, 0, 0, 0, 0, 0, 0, 0, 0.32] } },
        "豐碩之海": { "秘密航路": { AP: 18, item: [0, 0, 0, 0, 0, 0.3, 0, 0, 0, 0.09], item3: [0.16, 0, 0, 0, 0.1, 0, 0.24, 0.05] } }
    },
    "第四特異點":
        {
            "舊街": { "濃霧, 馬車與瓦斯燈": { AP: 15, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.12], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.56] } },
            "白色教堂": { "貧民窟": { AP: 15, item: [0, 0, 0, 0.12, 0, 0, 0, 0, 0, 0, 0.13], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.4, 0.05], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.02] } },
            "倫敦城": { "倫敦金融城": { AP: 15, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.12], item3: [0, 0, 0, 0, 0, 0, 0.56] } },
            "蘇活區": { "魅惑的繁華街": { AP: 16, item: [0, 0, 0, 0.16, 0, 0, 0, 0, 0, 0, 0.05, 0, 0.08], item3: [0, 0, 0, 0, 0, 0, 0.08, 0.05, 0, 0, 0, 0, 0, 0, 0, 0.08, 0.05], item4: [0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04] } },
            "威斯敏斯特": { "蘇格蘭場": { AP: 16, item: [0, 0, 0, 0.16, 0, 0, 0, 0, 0, 0, 0, 0, 0.12], item3: [0, 0, 0, 0, 0, 0, 0.24, 0.05], item4: [0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04] } },
            "攝政公園": { "王室的狩獵場": { AP: 16, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.085, 0.05], item3: [0.24, 0.05, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.24] } },
            "克勒肯維爾": { "治癒之井": { AP: 18, item: [0, 0.36, 0, 0, 0, 0, 0, 0, 0, 0, 0.255], item3: [0.2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.08, 0.15, 0.03] } },
            "薩瑟克": { "博羅市場": { AP: 19, item: [0, 0.27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.3], item3: [0, 0, 0, 0.15, 0, 0, 0.32, 0.1] } },
            "海德公園": { "水晶宮的殘影": { AP: 20, item: [0, 0.36, 0, 0, 0, 0, 0, 0, 0, 00, 0.255], item3: [0, 0, 0, 0, 0, 0, 0.2, 0, 0, 0, 0, 0, 0.08, 0.15, 0.03] } },


        },
    "第五特異點":
        {
            "布拉克山": { "聖山": { AP: 17, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.16], item3: [0, 0, 0, 0.4, 0, 0, ] } },
            "里弗頓": { "巨大河床": { AP: 17, item: [0.45, 0, 0, 0.32, 0], item3: [0.15, 0, 0, 0.05, 0, 0, 0.05, 0, 0.08], item4: [0, 0, 0, 0, 0, 0.2, 0, 0, 0, 0, 0, 0, 0.08] } },
            "丹佛": { "里高之城": { AP: 17, item: [0, 0, 0, 0.12, 0, 0, 0, 0, 0, 0, 0.15], item3: [0, 0, 0, 0.24, 0.1, 0, 0, 0, 0.02], item4: [0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.02] } },
            "德明": { "新芝加哥": { AP: 17, item: [0, 0, 0.6, 0, 0], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.39, 0.05] } },
            "拉伯克": { "德州騎警": { AP: 18, item: [0.54], item2: [0, 0, 0, 0, 0, 0, 0.12], item3: [0.2, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.08] } },
            "達拉斯": { "牛鎮體育館": { AP: 18, item: [0.66], item3: [0, 0, 0, 0.1, 0, 0, 0.25] } },
            "亞力山德里亞": { "威克斯島": { AP: 18, item: [0.54], item2: [0, 0, 0, 0, 0, 0.12], item3: [0.15, 0, 0, 0.05, 0.08, 0, 0.1] } },
            "阿爾卡特拉斯島": { "監獄島": { AP: 18, item: [0.54, 0, 0, 0.12, 0], item3: [0.05, 0, 0, 0, 0, 0, 0.25], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.02] } },
            "得梅因": { "監視據點": { AP: 18, item: [0, 0, 0, 0.16, 0, 0.09], item2: [0.2], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0.04, 0, 0, 0, 0, 0, 0, 0, 0.09], item4: [0, 0.08, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04] } },
            "卡尼": { "大平原": { AP: 18, item: [0.54, 0, 0, 0, 0], item2: [0, 0, 0, 0, 0.12], item3: [0.15, 0, 0, 0, 0, 0, 0.15, 0.08] } },
            "蒙哥馬利": { "南國醫戀(Hart of Dixie)": { AP: 18, item: [0.63, 0, 0, 0.16], item3: [0, 0, 0, 0.3, 0, 0, 0, 0, ], item4: [0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04, 0] } },
            "夏洛特": { "掏金熱": { AP: 20, item: [0.48, 0, 0, 0.64], item3: [0, 0, 0, 0.1, 0, 0, 0.1, 0, 0.04, 0, 0, 0, 0.05], item4: [0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0.3, 0, 0, 0.04, 0, 0, 0, 0.12] } },
            "華盛頓": { "特別行政區": { AP: 20, item: [0.54, 0, 0, 0, 0, 0, ], item2: [0, 0, 0, 0.08], item3: [0.15, 0, 0.03, 0.05, 0, 0, 0.05, 0, 0, 0, 0, 0, 0.05] } },
            "芝加哥": { "風之城": { AP: 21, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.4], item3: [0, 0, 0, 0.24, 0.15, 0.03, ] } }
        },
    "第六特異點":
        {
            "沙塵暴的沙漠": { "神獸之庭": { AP: 19, item: [0, 0.63], item2: [0, 0, 0, 0, 0, 0, 0, 0, 0.08], item3: [0.1, 0, 0, 0.1, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0, 0.03] } },
            "黎明的沙丘": { "灼熱之巔": { AP: 19, item: [0, 0, 0, 0, 0, 0, 0, 0, 0.15], item2: [0, 0, 0, 0, 0, 0, 0, 0.12], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.15, 0.47] } },
            "死之荒野": { "熱血沸騰的狂宴": { AP: 19, item: [0, 0, 0, 0, 0.66], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.2], item4: [0.15] } },
            "東之村": { "已然枯萎的山脊": { AP: 19, item: [0, 0, 0.42], item2: [0, 0, 0, 0, 0.16], item3: [0, 0, 0, 0, 0, 0, 0, 0.08, ] } },
            "圓桌要塞": { "游擊騎士隊": { AP: 19, item: [0.45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.187], item3: [0.1, 0.1, 0, 0, 0, 0, 0.15, 0.1] } },
            "晚鐘廟": { "宣告死亡的天使": { AP: 19, item: [0, 0, 0, 0, 0, 0, 0.31], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.47, 0.02] } },
            "西之村遺跡": { "無情的殘影": { AP: 20, item: [0, 0, 0, 0.458, 0], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.48], item4: [0, 0, 0, 0, 0, 0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04] } },
            "阿特拉斯院": { "巨人的地窖": { AP: 20, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.217, 0.09], item3: [0, 0, 0, 0.15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.08, 0, 0.1] } },
            "隱密之村": { "夢幻的海市蜃樓": { AP: 21, item: [0, 0, 0, 0, 0.315], item2: [0, 0, 0, 0, 0, 0, 0, 0.16], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.08, 0, 0.1], item4: [0.05] } },
            "大神殿": { "太陽王的居城": { AP: 22, item: [0, 0, 0, 0, 0.42], item2: [0, 0, 0, 0, 0, 0, 0, 0, 0.12], item3: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.06, 0.05], item4: [0.15] } },
            "聖都正門": { "祝聖之門": { AP: 20, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.3], item3: [0, 0.1, 0, 0, 0.05, 0, 0, 0.1] } },
            "聖都市街": { "理想都市": { AP: 20, item: [0.36, 0, 0, 0, 0, 0, 0, 0.27], item2: [0, 0, 0, 0.12], item3: [0.05, 0, 0.03, 0, 0, 0, 0.1, ], item4: [0, 0, 0.09] } },
            "王城": { "千年王國": { AP: 21, item: [0, 0, 0, 0.16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.35], item3: [0, 0.25, ], item4: [0, 0, 0, 0.1, 0, 0, 0, 0, 0, 0, 0.04] } },
            "無之大地": { "荒涼世界": { AP: 22, item: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0.45], item3: [0, 0, 0, 0.08, 0, 0.03, 0, 0, 0, 0.16, 0.05, 0.06, 0, 0, 0, 0, 0.05] } }
        }


};

//var every_day_quest = new FGO.events.Quest_manager();
/*
 * 希望格式:
 * data1 = {
 *  週日 劍之修鍊場: {
 *      初級: {
 *          AP: 10,
 *          drop: {
 *              A: 5
 *          }
 *      }
 *  }
 * }
 * 
 */
var every_day_parser_2_real_p = function (data) {
    var result = {};
    result["每日任務"] = {};
    for (var i in data) {
        result["每日任務"][i] = {};
        for (var j in data[i]) {
            result["每日任務"][i][j] = {};
            result["每日任務"][i][j].AP = data[i][j].AP;
            result["每日任務"][i][j].drop = {};
            for (var k in data[i][j].drop) {
                result["每日任務"][i][j]["drop"][k] = data[i][j]["drop"][k] * 100 / 10000;
            }
        }
    }
    return result;
};
var fq = function (data) {
    var item = ["英雄之證", "凶骨", "龍之牙", "虛影之塵", "愚者之鎖", "世界樹之種", "鬼魂提燈", "八連雙晶", "蛇之寶玉", "鳳凰羽毛", "無間齒輪", "禁斷書頁", "人工生命體幼體", "隕蹄鐵", "大騎士勳章", "追憶的貝殼"];
    var item2 = ["混沌之爪", "蠻神心臟", "龍之逆鱗", "精靈根", "戰馬的幼角", "血之淚石", "黑獸脂", "封魔之燈", "智慧之聖甲蟲像"];
    var item3 = ["劍之輝石", "劍之魔石", "劍之秘石", "弓之輝石", "弓之魔石", "弓之秘石", "槍之輝石", "槍之魔石", "槍之秘石", "騎之輝石", "騎之魔石", "騎之秘石", "術之輝石", "術之魔石", "術之秘石", "殺之輝石", "殺之魔石", "殺之秘石"];
    var item4 = ["狂之輝石", "狂之魔石", "狂之秘石", "劍階銀棋", "弓階銀棋", "槍階銀棋", "騎階銀棋", "術階銀棋", "殺階銀棋", "狂階銀棋", "劍階金像", "弓階金像", "槍階金像", "騎階金像", "術階金像", "殺階金像", "狂階金像"];

    var result = {};
    for (var i in data) {
        result[i] = {};
        for (var j in data[i]) {
            result[i][j] = {};
            for (var k in data[i][j]) {
                result[i][j][k] = {};
                result[i][j][k]["drop"] = {};
                for (var l in data[i][j][k]) {
                    switch (l) {
                        case "AP":
                            result[i][j][k][l] = data[i][j][k][l];
                            break;
                        case "item":
                            
                            for (var m = 0, max = data[i][j][k][l].length; m < max; m++) {
                                if (data[i][j][k][l][m] === 0) continue;
                                result[i][j][k]["drop"][item[m]] = data[i][j][k][l][m];
                            }
                            break;
                        case "item2":
                            //result[i][j][k]["drop"] = {};
                            for (var m = 0, max = data[i][j][k][l].length; m < max; m++) {
                                if (data[i][j][k][l][m] === 0) continue;
                                result[i][j][k]["drop"][item2[m]] = data[i][j][k][l][m];
                            }
                            break;
                        case "item3":
                            //result[i][j][k]["drop"] = {};
                            for (var m = 0, max = data[i][j][k][l].length; m < max; m++) {
                                if (data[i][j][k][l][m] === 0) continue;
                                result[i][j][k]["drop"][item3[m]] = data[i][j][k][l][m];
                            }
                            break;
                        case "item4":
                            //result[i][j][k]["drop"] = {};
                            for (var m = 0, max = data[i][j][k][l].length; m < max; m++) {
                                if (data[i][j][k][l][m] === 0) continue;
                                result[i][j][k]["drop"][item4[m]] = data[i][j][k][l][m];
                            }
                            break;
                    }
                }
            }
        }
    }
    return result;
};
var mix = function (a, b) {
    var result = {};
    JIE.base.extendDeep(result, a);
    JIE.base.extendDeep(result, b);
    return result;
};

var every = every_day_parser_2_real_p(every_day_data);
var free = fq(drop_data);

var every_json = JSON.stringify(every);
var free_json = JSON.stringify(free);

var total = mix(every, free);
var json = JSON.stringify(total);
//======================================================================================
