FGO.normal.quest_data_manager = function () {
    var schedule_list = ["特異點F", "第一特異點", "第二特異點", "第三特異點", "第四特異點", "第五特異點", "第六特異點"];
    var every_data_quest_list = {
        "每日任務": {
            "週日 劍之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "劍之輝石": 1.2603,
                        "英雄之證": 0.145,
                        "虛影之塵": 0.0533,
                        "無間齒輪": 0.0475,
                        "龍之牙": 0.045,
                        "兇骨": 0.235,
                        "劍階銀棋": 0.2167,
                        "劍階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "劍之輝石": 0.9956,
                        "劍之魔石": 0.6416,
                        "世界樹之種": 0.1392,
                        "英雄之證": 0.14,
                        "虛影之塵": 0.1467,
                        "無間齒輪": 0.1017,
                        "劍階銀棋": 0.6833,
                        "劍階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "劍之輝石": 0.3017,
                        "劍之魔石": 1.2249,
                        "劍之秘石": 0.0133,
                        "鳳凰羽毛": 0.18,
                        "世界樹之種": 0.2967,
                        "英雄之證": 0.165,
                        "虛影之塵": 0.225,
                        "無間齒輪": 0.1533,
                        "劍階銀棋": 1.0416,
                        "劍階金像": 0.35
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "劍之輝石": 0.3217,
                        "劍之魔石": 1.1333,
                        "劍之秘石": 0.2433,
                        "鳳凰羽毛": 0.13,
                        "世界樹之種": 0.3533,
                        "英雄之證": 0.215,
                        "虛影之塵": 0.2733,
                        "無間齒輪": 0.25,
                        "劍階銀棋": 0.77,
                        "劍階金像": 0.5533
                    }
                }
            },
            "週一 弓之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "弓之輝石": 1.3363,
                        "英雄之證": 0.0917,
                        "虛影之塵": 0.0533,
                        "龍之牙": 0.0367,
                        "隕蹄鐵": 0.0493,
                        "兇骨": 0.2367,
                        "弓階銀棋": 0.2167,
                        "弓階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "弓之輝石": 1.3632,
                        "弓之魔石": 0.3833,
                        "鳳凰羽毛": 0.0067,
                        "世界樹之種": 0.1383,
                        "英雄之證": 0.0733,
                        "虛影之塵": 0.1467,
                        "龍之牙": 0.0067,
                        "隕蹄鐵": 0.1033,
                        "兇骨": 0.3033,
                        "弓階銀棋": 0.6833,
                        "弓階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "弓之輝石": 0.1917,
                        "弓之魔石": 1.5443,
                        "弓之秘石": 0.1367,
                        "鳳凰羽毛": 0.1017,
                        "世界樹之種": 0.145,
                        "英雄之證": 0.135,
                        "虛影之塵": 0.22,
                        "隕蹄鐵": 0.1498,
                        "弓階銀棋": 1.0833,
                        "弓階金像": 0.3533
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "弓之輝石": 0.19,
                        "弓之魔石": 1.305,
                        "弓之秘石": 0.284,
                        "鳳凰羽毛": 0.205,
                        "世界樹之種": 0.1975,
                        "英雄之證": 0.185,
                        "虛影之塵": 0.24,
                        "隕蹄鐵": 0.225,
                        "弓階銀棋": 0.8166,
                        "弓階金像": 0.5766
                    }
                }
            },
            "週二 槍之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "槍之輝石": 1.175,
                        "英雄之證": 0.1302,
                        "虛影之塵": 0.0533,
                        "人工生命體幼體": 0.05,
                        "兇骨": 0.27,
                        "槍階銀棋": 0.2167,
                        "槍階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "槍之輝石": 1.1466,
                        "槍之魔石": 0.6266,
                        "世界樹之種": 0.12,
                        "英雄之證": 0.068,
                        "虛影之塵": 0.1467,
                        "人工生命體幼體": 0.1033,
                        "兇骨": 0.1686,
                        "槍階銀棋": 0.6833,
                        "槍階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "槍之輝石": 0.1833,
                        "槍之魔石": 1.5443,
                        "槍之秘石": 0.11,
                        "鳳凰羽毛": 0.0867,
                        "世界樹之種": 0.205,
                        "英雄之證": 0.135,
                        "虛影之塵": 0.22,
                        "人工生命體幼體": 0.1573,
                        "槍階銀棋": 1.0333,
                        "槍階金像": 0.3533
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "槍之輝石": 0.1913,
                        "槍之魔石": 1.29,
                        "槍之秘石": 0.2366,
                        "鳳凰羽毛": 0.1333,
                        "世界樹之種": 0.265,
                        "英雄之證": 0.185,
                        "虛影之塵": 0.2733,
                        "人工生命體幼體": 0.2367,
                        "槍階銀棋": 0.8,
                        "槍階金像": 0.57
                    }
                }
            },
            "週三 狂之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "狂之輝石": 1.3667,
                        "英雄之證": 0.1,
                        "虛影之塵": 0.038,
                        "八連雙晶": 0.0553,
                        "狂階銀棋": 0.1833,
                        "狂階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "狂之輝石": 1.2908,
                        "狂之魔石": 0.6125,
                        "英雄之證": 0.065,
                        "虛影之塵": 0.1712,
                        "混沌之爪": 0.03,
                        "八連雙晶": 0.1178,
                        "狂階銀棋": 0.6642,
                        "狂階金像": 0.0783
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "狂之輝石": 0.1833,
                        "狂之魔石": 1.5443,
                        "狂之秘石": 0.11,
                        "英雄之證": 0.1475,
                        "虛影之塵": 0.225,
                        "混沌之爪": 0.06,
                        "八連雙晶": 0.1207,
                        "狂階銀棋": 1.0917,
                        "狂階金像": 0.3867
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "狂之輝石": 0.18,
                        "狂之魔石": 1.16,
                        "狂之秘石": 0.24,
                        "英雄之證": 0.2217,
                        "虛影之塵": 0.2267,
                        "混沌之爪": 0.09,
                        "八連雙晶": 0.1517,
                        "狂階銀棋": 0.8667,
                        "狂階金像": 0.5633
                    }
                }
            },
            "週四 騎之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "騎之輝石": 1.1212,
                        "虛影之塵": 0.0533,
                        "龍之牙": 0.1717,
                        "隕蹄鐵": 0.0495,
                        "騎階銀棋": 0.2167,
                        "騎階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "騎之輝石": 0.9133,
                        "騎之魔石": 0.9241,
                        "虛影之塵": 0.1467,
                        "龍之牙": 0.2875,
                        "隕蹄鐵": 0.1033,
                        "騎階銀棋": 0.6833,
                        "騎階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "騎之輝石": 0.2318,
                        "騎之魔石": 1.2108,
                        "騎之秘石": 0.2367,
                        "虛影之塵": 0.135,
                        "龍之逆鱗": 0.03,
                        "龍之牙": 0.4622,
                        "隕蹄鐵": 0.145,
                        "騎階銀棋": 1.0417,
                        "騎階金像": 0.3733
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "騎之輝石": 0.198,
                        "騎之魔石": 0.9933,
                        "騎之秘石": 0.3866,
                        "虛影之塵": 0.16,
                        "龍之逆鱗": 0.08,
                        "龍之牙": 0.472,
                        "隕蹄鐵": 0.1875,
                        "騎階銀棋": 0.8,
                        "騎階金像": 0.59
                    }
                }
            },
            "週五 術之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "術之輝石": 1.2267,
                        "術之魔石": 0.109,
                        "虛影之塵": 0.1333,
                        "蛇之寶玉": 0.0742,
                        "禁斷書頁": 0.05,
                        "術階銀棋": 0.3167,
                        "術階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "術之輝石": 0.9567,
                        "術之魔石": 0.7667,
                        "虛影之塵": 0.22,
                        "蛇之寶玉": 0.14,
                        "禁斷書頁": 0.1,
                        "術階銀棋": 0.825,
                        "術階金像": 0.0625
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "術之輝石": 0.0453,
                        "術之魔石": 1.6989,
                        "術之秘石": 0.24,
                        "虛影之塵": 0.2053,
                        "蛇之寶玉": 0.2177,
                        "禁斷書頁": 0.1575,
                        "蠻神心臟": 0.04,
                        "術階銀棋": 0.945,
                        "術階金像": 0.318
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "術之輝石": 0.0925,
                        "術之魔石": 0.8986,
                        "術之秘石": 0.795,
                        "虛影之塵": 0.2467,
                        "蛇之寶玉": 0.2486,
                        "禁斷書頁": 0.2115,
                        "蠻神心臟": 0.06,
                        "術階銀棋": 0.8208,
                        "術階金像": 0.5658
                    }
                }
            },
            "週六 殺之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "殺之輝石": 1.3133,
                        "虛影之塵": 0.1067,
                        "鬼魂提燈": 0.0333,
                        "無間齒輪": 0.052,
                        "龍之牙": 0.1267,
                        "殺階銀棋": 0.2833,
                        "殺階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "殺之輝石": 0.8259,
                        "殺之魔石": 1.0806,
                        "世界樹之種": 0.0867,
                        "虛影之塵": 0.16,
                        "鬼魂提燈": 0.0283,
                        "無間齒輪": 0.1,
                        "龍之牙": 0.1767,
                        "殺階銀棋": 0.6833,
                        "殺階金像": 0.0783
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "殺之輝石": 0.164,
                        "殺之魔石": 1.4065,
                        "殺之秘石": 0.1333,
                        "世界樹之種": 0.165,
                        "虛影之塵": 0.16,
                        "鬼魂提燈": 0.1642,
                        "無間齒輪": 0.1547,
                        "龍之牙": 0.11,
                        "殺階銀棋": 1.0333,
                        "殺階金像": 0.36
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "殺之輝石": 0.1667,
                        "殺之魔石": 1.0982,
                        "殺之秘石": 0.25,
                        "世界樹之種": 0.3116,
                        "虛影之塵": 0.1933,
                        "鬼魂提燈": 0.188,
                        "無間齒輪": 0.0067,
                        "龍之牙": 0.1433,
                        "殺階銀棋": 0.8,
                        "殺階金像": 0.5767
                    }
                }
            }
        }
    };
    var every_data_quest_list_v2 = {
        "每日任務": {
            "週日 劍之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "劍之輝石": 1.2603,
                        "英雄之證": 0.145,
                        "虛影之塵": 0.0533,
                        "無間齒輪": 0.0475,
                        "龍之牙": 0.045,
                        "兇骨": 0.235,
                        "劍階銀棋": 0.2167,
                        "劍階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "劍之輝石": 0.9956,
                        "劍之魔石": 0.6416,
                        "世界樹之種": 0.1392,
                        "英雄之證": 0.14,
                        "虛影之塵": 0.1467,
                        "無間齒輪": 0.1017,
                        "劍階銀棋": 0.6833,
                        "劍階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "劍之輝石": 0.3017,
                        "劍之魔石": 1.2249,
                        "劍之秘石": 0.0133,
                        "鳳凰羽毛": 0.172,
                        "世界樹之種": 0.276,
                        "英雄之證": 0.165,
                        "虛影之塵": 0.2065,
                        "無間齒輪": 0.15,
                        "劍階銀棋": 1.0416,
                        "劍階金像": 0.35,
                        "精靈根": 0.04
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "劍之輝石": 0.3217,
                        "劍之魔石": 1.1333,
                        "劍之秘石": 0.2433,
                        "鳳凰羽毛": 0.115,
                        "世界樹之種": 0.312,
                        "英雄之證": 0.215,
                        "虛影之塵": 0.240,
                        "無間齒輪": 0.216,
                        "劍階銀棋": 0.77,
                        "劍階金像": 0.5533,
                        "精靈根": 0.0875
                    }
                }
            },
            "週一 弓之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "弓之輝石": 1.3363,
                        "英雄之證": 0.0917,
                        "虛影之塵": 0.0533,
                        "龍之牙": 0.0367,
                        "隕蹄鐵": 0.0493,
                        "兇骨": 0.2367,
                        "弓階銀棋": 0.2167,
                        "弓階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "弓之輝石": 1.3632,
                        "弓之魔石": 0.3833,
                        "鳳凰羽毛": 0.0067,
                        "世界樹之種": 0.1383,
                        "英雄之證": 0.0733,
                        "虛影之塵": 0.1467,
                        "龍之牙": 0.0067,
                        "隕蹄鐵": 0.1033,
                        "兇骨": 0.3033,
                        "弓階銀棋": 0.6833,
                        "弓階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "弓之輝石": 0.1917,
                        "弓之魔石": 1.5443,
                        "弓之秘石": 0.1367,
                        "鳳凰羽毛": 0.1017,
                        "世界樹之種": 0.145,
                        "英雄之證": 0.135,
                        "虛影之塵": 0.22,
                        "隕蹄鐵": 0.1498,
                        "弓階銀棋": 1.0833,
                        "弓階金像": 0.3533
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "弓之輝石": 0.19,
                        "弓之魔石": 1.305,
                        "弓之秘石": 0.284,
                        "鳳凰羽毛": 0.205,
                        "世界樹之種": 0.1975,
                        "英雄之證": 0.185,
                        "虛影之塵": 0.24,
                        "隕蹄鐵": 0.225,
                        "弓階銀棋": 0.8166,
                        "弓階金像": 0.5766
                    }
                }
            },
            "週二 槍之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "槍之輝石": 1.175,
                        "英雄之證": 0.1302,
                        "虛影之塵": 0.0533,
                        "人工生命體幼體": 0.05,
                        "兇骨": 0.27,
                        "槍階銀棋": 0.2167,
                        "槍階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "槍之輝石": 1.1466,
                        "槍之魔石": 0.6266,
                        "世界樹之種": 0.12,
                        "英雄之證": 0.068,
                        "虛影之塵": 0.1467,
                        "人工生命體幼體": 0.1033,
                        "兇骨": 0.1686,
                        "槍階銀棋": 0.6833,
                        "槍階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "槍之輝石": 0.1833,
                        "槍之魔石": 1.5443,
                        "槍之秘石": 0.11,
                        "鳳凰羽毛": 0.0867,
                        "世界樹之種": 0.205,
                        "英雄之證": 0.135,
                        "虛影之塵": 0.22,
                        "人工生命體幼體": 0.1573,
                        "槍階銀棋": 1.0333,
                        "槍階金像": 0.3533
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "槍之輝石": 0.1913,
                        "槍之魔石": 1.29,
                        "槍之秘石": 0.2366,
                        "鳳凰羽毛": 0.1333,
                        "世界樹之種": 0.265,
                        "英雄之證": 0.185,
                        "虛影之塵": 0.2733,
                        "人工生命體幼體": 0.2367,
                        "槍階銀棋": 0.8,
                        "槍階金像": 0.57
                    }
                }
            },
            "週三 狂之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "狂之輝石": 1.3667,
                        "英雄之證": 0.1,
                        "虛影之塵": 0.038,
                        "八連雙晶": 0.0553,
                        "狂階銀棋": 0.1833,
                        "狂階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "狂之輝石": 1.2908,
                        "狂之魔石": 0.6125,
                        "英雄之證": 0.065,
                        "虛影之塵": 0.1712,
                        "混沌之爪": 0.03,
                        "八連雙晶": 0.1178,
                        "狂階銀棋": 0.6642,
                        "狂階金像": 0.0783
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "狂之輝石": 0.1833,
                        "狂之魔石": 1.5443,
                        "狂之秘石": 0.11,
                        "英雄之證": 0.1475,
                        "虛影之塵": 0.225,
                        "混沌之爪": 0.06,
                        "八連雙晶": 0.1207,
                        "狂階銀棋": 1.0917,
                        "狂階金像": 0.3867
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "狂之輝石": 0.18,
                        "狂之魔石": 1.16,
                        "狂之秘石": 0.24,
                        "英雄之證": 0.2217,
                        "虛影之塵": 0.2267,
                        "混沌之爪": 0.09,
                        "八連雙晶": 0.1517,
                        "狂階銀棋": 0.8667,
                        "狂階金像": 0.5633
                    }
                }
            },
            "週四 騎之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "騎之輝石": 1.1212,
                        "虛影之塵": 0.0533,
                        "龍之牙": 0.1717,
                        "隕蹄鐵": 0.0495,
                        "騎階銀棋": 0.2167,
                        "騎階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "騎之輝石": 0.9133,
                        "騎之魔石": 0.9241,
                        "虛影之塵": 0.1467,
                        "龍之牙": 0.2875,
                        "隕蹄鐵": 0.1033,
                        "騎階銀棋": 0.6833,
                        "騎階金像": 0.0717
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "騎之輝石": 0.2318,
                        "騎之魔石": 1.2108,
                        "騎之秘石": 0.2367,
                        "虛影之塵": 0.135,
                        "龍之逆鱗": 0.03,
                        "龍之牙": 0.4622,
                        "隕蹄鐵": 0.145,
                        "騎階銀棋": 1.0417,
                        "騎階金像": 0.3733
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "騎之輝石": 0.198,
                        "騎之魔石": 0.9933,
                        "騎之秘石": 0.3866,
                        "虛影之塵": 0.16,
                        "龍之逆鱗": 0.08,
                        "龍之牙": 0.472,
                        "隕蹄鐵": 0.1875,
                        "騎階銀棋": 0.8,
                        "騎階金像": 0.59
                    }
                }
            },
            "週五 術之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "術之輝石": 1.2267,
                        "術之魔石": 0.109,
                        "虛影之塵": 0.1333,
                        "蛇之寶玉": 0.0742,
                        "禁斷書頁": 0.05,
                        "術階銀棋": 0.3167,
                        "術階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "術之輝石": 0.9567,
                        "術之魔石": 0.7667,
                        "虛影之塵": 0.22,
                        "蛇之寶玉": 0.14,
                        "禁斷書頁": 0.1,
                        "術階銀棋": 0.825,
                        "術階金像": 0.0625
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "術之輝石": 0.0453,
                        "術之魔石": 1.6989,
                        "術之秘石": 0.24,
                        "虛影之塵": 0.2053,
                        "蛇之寶玉": 0.2177,
                        "禁斷書頁": 0.1575,
                        "蠻神心臟": 0.04,
                        "術階銀棋": 0.945,
                        "術階金像": 0.318
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "術之輝石": 0.0925,
                        "術之魔石": 0.8986,
                        "術之秘石": 0.795,
                        "虛影之塵": 0.2467,
                        "蛇之寶玉": 0.2486,
                        "禁斷書頁": 0.2115,
                        "蠻神心臟": 0.06,
                        "術階銀棋": 0.8208,
                        "術階金像": 0.5658
                    }
                }
            },
            "週六 殺之修鍊場": {
                "初級": {
                    "AP": 10,
                    "drop": {
                        "殺之輝石": 1.3133,
                        "虛影之塵": 0.1067,
                        "鬼魂提燈": 0.0333,
                        "無間齒輪": 0.052,
                        "龍之牙": 0.1267,
                        "殺階銀棋": 0.2833,
                        "殺階金像": 0.02
                    }
                },
                "中級": {
                    "AP": 20,
                    "drop": {
                        "殺之輝石": 0.8259,
                        "殺之魔石": 1.0806,
                        "世界樹之種": 0.0867,
                        "虛影之塵": 0.16,
                        "鬼魂提燈": 0.0283,
                        "無間齒輪": 0.1,
                        "龍之牙": 0.1767,
                        "殺階銀棋": 0.6833,
                        "殺階金像": 0.0783
                    }
                },
                "上級": {
                    "AP": 30,
                    "drop": {
                        "殺之輝石": 0.164,
                        "殺之魔石": 1.4065,
                        "殺之秘石": 0.1333,
                        "世界樹之種": 0.165,
                        "虛影之塵": 0.16,
                        "鬼魂提燈": 0.1642,
                        "無間齒輪": 0.1547,
                        "龍之牙": 0.11,
                        "殺階銀棋": 1.0333,
                        "殺階金像": 0.36
                    }
                },
                "超級": {
                    "AP": 40,
                    "drop": {
                        "殺之輝石": 0.1667,
                        "殺之魔石": 1.0982,
                        "殺之秘石": 0.25,
                        "世界樹之種": 0.3116,
                        "虛影之塵": 0.1933,
                        "鬼魂提燈": 0.188,
                        "無間齒輪": 0.0067,
                        "龍之牙": 0.1433,
                        "殺階銀棋": 0.8,
                        "殺階金像": 0.5767
                    }
                }
            }
        }
    };
    var free_quest_list = {
        "特異點F": {
            "未確認座標X-A": {
                "宅邸殘跡": {
                    "drop": {
                        "兇骨": 0.075
                    },
                    "AP": 3
                }
            },
            "未確認座標X-B": {
                "爆炸中心地": {
                    "drop": {
                        "兇骨": 0.125,
                        "劍之輝石": 0.15,
                        "槍之輝石": 0.1
                    },
                    "AP": 4
                }
            },
            "未確認座標X-C": {
                "大橋": {
                    "drop": {
                        "兇骨": 0.18,
                        "劍之輝石": 0.2
                    },
                    "AP": 4
                }
            },
            "未確認座標X-D": {
                "鮮紅港口": {
                    "drop": {
                        "兇骨": 0.21,
                        "劍之輝石": 0.2,
                        "弓之輝石": 0.2,
                        "槍之輝石": 0.15
                    },
                    "AP": 5
                }
            },
            "未確認座標X-E": {
                "骸骨徬徨的教會": {
                    "drop": {
                        "兇骨": 0.16,
                        "劍之輝石": 0.2,
                        "弓之輝石": 0.1,
                        "騎階銀棋": 0.05
                    },
                    "AP": 5
                }
            },
            "未確認座標X-F": {
                "燒盡崩塌地校舍": {
                    "drop": {
                        "兇骨": 0.17,
                        "劍之輝石": 0.15,
                        "弓之輝石": 0.15,
                        "槍階銀棋": 0.05,
                        "殺階銀棋": 0.05
                    },
                    "AP": 6
                }
            },
            "未確認座標X-G": {
                "熊熊燃燒的森林": {
                    "drop": {
                        "兇骨": 0.63,
                        "劍之輝石": 0.1,
                        "弓之輝石": 0.05,
                        "槍之輝石": 0.2,
                        "狂階銀棋": 0.1,
                        "狂階金像": 0.04
                    },
                    "AP": 15
                }
            },
            "變動座標點0號": {
                "大空洞": {
                    "drop": {
                        "龍之牙": 0.11,
                        "虛影之塵": 0.08,
                        "劍之輝石": 0.05,
                        "弓之輝石": 0.05,
                        "殺之輝石": 0.2,
                        "劍階銀棋": 0.1
                    },
                    "AP": 7
                }
            }
        },
        "第一特異點": {
            "棟雷米": {
                "貞德誕生地": {
                    "drop": {
                        "英雄之證": 0.21,
                        "劍之輝石": 0.25,
                        "槍之輝石": 0.1
                    },
                    "AP": 7
                }
            },
            "沃庫勒爾": {
                "起始的堡壘": {
                    "drop": {
                        "兇骨": 0.06,
                        "龍之牙": 0.8,
                        "劍之輝石": 0.1,
                        "騎之魔石": 0.2
                    },
                    "AP": 7
                }
            },
            "拉沙里泰": {
                "盧瓦爾河畔": {
                    "drop": {
                        "英雄之證": 0.06,
                        "龍之牙": 0.13,
                        "槍之輝石": 0.1,
                        "騎之輝石": 0.33
                    },
                    "AP": 7
                }
            },
            "汝拉": {
                "太古之森": {
                    "drop": {
                        "龍之牙": 0.06,
                        "虛影之塵": 0.08,
                        "世界樹之種": 0.05,
                        "劍之輝石": 0.16,
                        "槍之輝石": 0.16,
                        "騎之輝石": 0.16,
                        "殺之輝石": 0.08,
                        "騎階銀棋": 0.1
                    },
                    "AP": 7
                }
            },
            "里昂": {
                "死者之城": {
                    "drop": {
                        "英雄之證": 0.21,
                        "虛影之塵": 0.08,
                        "劍之輝石": 0.25,
                        "殺階銀棋": 0.1
                    },
                    "AP": 7
                }
            },
            "蒂耶爾": {
                "刃物之鎮": {
                    "drop": {
                        "龍之牙": 0.13,
                        "虛影之塵": 0.08,
                        "騎之輝石": 0.33,
                        "狂階銀棋": 0.1
                    },
                    "AP": 7
                }
            },
            "奧爾良": {
                "命運的堡壘": {
                    "drop": {
                        "兇骨": 0.12,
                        "龍之牙": 0.11,
                        "虛影之塵": 0.08,
                        "槍之輝石": 0.1,
                        "騎之輝石": 0.16,
                        "騎之魔石": 0.05,
                        "術階銀棋": 0.1
                    },
                    "AP": 8
                }
            },
            "巴黎": {
                "藝術之都": {
                    "drop": {
                        "兇骨": 0.18,
                        "龍之牙": 0.09,
                        "虛影之塵": 0.08,
                        "弓之輝石": 0.15,
                        "騎之輝石": 0.1,
                        "騎之魔石": 0.05,
                        "劍階銀棋": 0.02,
                        "弓階銀棋": 0.02,
                        "槍階銀棋": 0.02
                    },
                    "AP": 13
                }
            }
        },
        "第二特異點": {
            "馬賽": {
                "毗領地中海": {
                    "drop": {
                        "英雄之證": 0.3,
                        "劍之輝石": 0.2,
                        "槍之輝石": 0.25
                    },
                    "AP": 7
                }
            },
            "波爾多": {
                "美酒, 乾杯": {
                    "drop": {
                        "世界樹之種": 0.09,
                        "劍之輝石": 0.08,
                        "槍之輝石": 0.32,
                        "殺之輝石": 0.24
                    },
                    "AP": 7
                }
            },
            "亞壁街道": {
                "街道女王": {
                    "drop": {
                        "英雄之證": 0.36,
                        "虛影之塵": 0.08,
                        "劍之輝石": 0.15,
                        "弓之輝石": 0.15,
                        "槍之輝石": 0.1,
                        "狂階銀棋": 0.1
                    },
                    "AP": 9
                }
            },
            "羅馬": {
                "羅馬非一日建成": {
                    "drop": {
                        "英雄之證": 0.24,
                        "劍之輝石": 0.25,
                        "槍之輝石": 0.32
                    },
                    "AP": 9
                }
            },
            "佛羅倫薩": {
                "花之都": {
                    "drop": {
                        "英雄之證": 0.3,
                        "劍之輝石": 0.05,
                        "弓之輝石": 0.3,
                        "槍之輝石": 0.1
                    },
                    "AP": 9
                }
            },
            "梅迪奧蘭": {
                "平原中心": {
                    "drop": {
                        "英雄之證": 0.33,
                        "劍之輝石": 0.15,
                        "槍之輝石": 0.2
                    },
                    "AP": 9
                }
            },
            "瑪西格利亞": {
                "遠古的港口": {
                    "drop": {
                        "英雄之證": 0.12,
                        "虛影之塵": 0.16,
                        "劍之輝石": 0.1,
                        "槍之輝石": 0.1,
                        "騎階銀棋": 0.1,
                        "狂階銀棋": 0.1
                    },
                    "AP": 9
                }
            },
            "高盧": {
                "燃燒的戰火": {
                    "drop": {
                        "英雄之證": 0.15,
                        "虛影之塵": 0.08,
                        "八連雙晶": 0.05,
                        "弓之輝石": 0.1,
                        "槍之輝石": 0.15,
                        "狂之輝石": 0.15,
                        "劍階銀棋": 0.1
                    },
                    "AP": 9
                }
            },
            "有形之島": {
                "女神的洞窟": {
                    "drop": {
                        "兇骨": 0.21,
                        "虛影之塵": 0.08,
                        "弓之輝石": 0.25,
                        "槍之輝石": 0.05,
                        "狂階銀棋": 0.1
                    },
                    "AP": 9
                }
            },
            "聯軍首都": {
                "羅馬的地平線": {
                    "drop": {
                        "英雄之證": 0.18,
                        "虛影之塵": 0.08,
                        "八連雙晶": 0.022,
                        "劍之輝石": 0.05,
                        "弓之輝石": 0.1,
                        "狂之輝石": 0.13,
                        "狂階銀棋": 0.1
                    },
                    "AP": 10
                }
            },
            "埃特納火山": {
                "沸騰的大地": {
                    "drop": {
                        "鬼魂提燈": 0.08,
                        "殺之輝石": 0.35
                    },
                    "AP": 9
                }
            },
            "不列顛尼亞": {
                "濃霧深邃之森": {
                    "drop": {
                        "世界樹之種": 0.11,
                        "劍之輝石": 0.24,
                        "槍之輝石": 0.24,
                        "殺之輝石": 0.16
                    },
                    "AP": 10
                }
            },
            "日耳曼尼亞": {
                "黑森林": {
                    "drop": {
                        "兇骨": 0.45,
                        "混沌之爪": 0.03,
                        "劍之輝石": 0.05,
                        "弓之輝石": 0.1,
                        "狂之魔石": 0.08
                    },
                    "AP": 15
                }
            }
        },
        "第三特異點": {
            "海盜船": {
                "私掠船團": {
                    "drop": {
                        "英雄之證": 0.57,
                        "劍之輝石": 0.2,
                        "弓之輝石": 0.25
                    },
                    "AP": 12
                }
            },
            "海盜島": {
                "海盜大本營": {
                    "drop": {
                        "英雄之證": 0.54,
                        "虛影之塵": 0.12,
                        "弓之輝石": 0.25,
                        "狂之輝石": 0.15,
                        "騎階銀棋": 0.1,
                        "騎階金像": 0.02
                    },
                    "AP": 13
                }
            },
            "亡者的居島": {
                "被詛咒的海盜們": {
                    "drop": {
                        "英雄之證": 0.3,
                        "虛影之塵": 0.12,
                        "弓之輝石": 0.15,
                        "狂之輝石": 0.1,
                        "狂階銀棋": 0.1,
                        "狂階金像": 0.02
                    },
                    "AP": 13
                }
            },
            "地圖上標記的島": {
                "公牛迷宮": {
                    "drop": {
                        "龍之牙": 0.36,
                        "虛影之塵": 0.12,
                        "劍之輝石": 0.25,
                        "弓之輝石": 0.15,
                        "狂階銀棋": 0.1,
                        "狂階金像": 0.02
                    },
                    "AP": 13
                }
            },
            "潮眼之海": {
                "自由的海原": {
                    "drop": {
                        "英雄之證": 0.27,
                        "八連雙晶": 0.114,
                        "弓之輝石": 0.2,
                        "狂之輝石": 0.18,
                        "狂之魔石": 0.05
                    },
                    "AP": 14
                }
            },
            "翼龍之島": {
                "龍群的樂園": {
                    "drop": {
                        "龍之牙": 0.48,
                        "騎之輝石": 0.44,
                        "騎之魔石": 0.05
                    },
                    "AP": 14
                }
            },
            "暴風雨海域": {
                "徬徨的幽靈船": {
                    "drop": {
                        "鬼魂提燈": 0.225,
                        "殺之輝石": 0.49
                    },
                    "AP": 15
                }
            },
            "群島": {
                "寂靜的入海口": {
                    "drop": {
                        "英雄之證": 0.18,
                        "龍之牙": 0.12,
                        "虛影之塵": 0.24,
                        "劍之輝石": 0.3,
                        "術階銀棋": 0.1,
                        "狂階銀棋": 0.1,
                        "術階金像": 0.02,
                        "狂階金像": 0.02
                    },
                    "AP": 15
                },
                "隠された島": {
                    "drop": {
                        "追憶的貝殼": 0.24,
                        "劍之輝石": 0.46,
                        "劍之魔石": 0.05
                    },
                    "AP": 16
                }
            },
            "暗礁海域": {
                "船舶墳墓": {
                    "drop": {
                        "兇骨": 0.36,
                        "蛇之寶玉": 0.135,
                        "弓之輝石": 0.25,
                        "術之魔石": 0.15,
                        "術之秘石": 0.23
                    },
                    "AP": 17
                }
            },
            "火山臼之島": {
                "無人發現的島嶼": {
                    "drop": {
                        "世界樹之種": 0.15,
                        "隕蹄鐵": 0.12,
                        "劍之輝石": 0.4,
                        "騎之輝石": 0.32
                    },
                    "AP": 17
                }
            },
            "豐碩之海": {
                "秘密航路": {
                    "drop": {
                        "世界樹之種": 0.3,
                        "鳳凰羽毛": 0.09,
                        "劍之輝石": 0.16,
                        "弓之魔石": 0.1,
                        "槍之輝石": 0.24,
                        "槍之魔石": 0.05
                    },
                    "AP": 18
                }
            }
        },
        "第四特異點": {
            "舊街": {
                "濃霧, 馬車與瓦斯燈": {
                    "drop": {
                        "無間齒輪": 0.12,
                        "殺之輝石": 0.56
                    },
                    "AP": 15
                }
            },
            "白色教堂": {
                "貧民窟": {
                    "drop": {
                        "虛影之塵": 0.12,
                        "無間齒輪": 0.13,
                        "殺之輝石": 0.4,
                        "殺之魔石": 0.05,
                        "殺階銀棋": 0.1,
                        "殺階金像": 0.02
                    },
                    "AP": 15
                }
            },
            "倫敦城": {
                "倫敦金融城": {
                    "drop": {
                        "人工生命體幼體": 0.12,
                        "槍之輝石": 0.56
                    },
                    "AP": 15
                }
            },
            "蘇活區": {
                "魅惑的繁華街": {
                    "drop": {
                        "虛影之塵": 0.16,
                        "無間齒輪": 0.05,
                        "人工生命體幼體": 0.08,
                        "槍之輝石": 0.08,
                        "槍之魔石": 0.05,
                        "殺之輝石": 0.08,
                        "殺之魔石": 0.05,
                        "術階銀棋": 0.1,
                        "術階金像": 0.04
                    },
                    "AP": 16
                }
            },
            "威斯敏斯特": {
                "蘇格蘭場": {
                    "drop": {
                        "虛影之塵": 0.16,
                        "人工生命體幼體": 0.12,
                        "槍之輝石": 0.24,
                        "槍之魔石": 0.05,
                        "術階銀棋": 0.1,
                        "術階金像": 0.04
                    },
                    "AP": 16
                }
            },
            "攝政公園": {
                "王室的狩獵場": {
                    "drop": {
                        "無間齒輪": 0.085,
                        "禁斷書頁": 0.05,
                        "劍之輝石": 0.24,
                        "劍之魔石": 0.05,
                        "術之魔石": 0.24
                    },
                    "AP": 16
                }
            },
            "克勒肯維爾": {
                "治癒之井": {
                    "drop": {
                        "兇骨": 0.36,
                        "無間齒輪": 0.255,
                        "劍之輝石": 0.2,
                        "殺之輝石": 0.08,
                        "殺之魔石": 0.15,
                        "殺之秘石": 0.03
                    },
                    "AP": 18
                }
            },
            "薩瑟克": {
                "博羅市場": {
                    "drop": {
                        "兇骨": 0.27,
                        "人工生命體幼體": 0.3,
                        "弓之輝石": 0.15,
                        "槍之輝石": 0.32,
                        "槍之魔石": 0.1
                    },
                    "AP": 19
                }
            },
            "海德公園": {
                "水晶宮的殘影": {
                    "drop": {
                        "兇骨": 0.36,
                        "無間齒輪": 0.255,
                        "槍之輝石": 0.2,
                        "術之輝石": 0.08,
                        "術之魔石": 0.15,
                        "術之秘石": 0.03
                    },
                    "AP": 20
                }
            }
        },
        "第五特異點": {
            "布拉克山": {
                "聖山": {
                    "drop": {
                        "無間齒輪": 0.16,
                        "弓之輝石": 0.4
                    },
                    "AP": 17
                }
            },
            "里弗頓": {
                "巨大河床": {
                    "drop": {
                        "英雄之證": 0.45,
                        "虛影之塵": 0.32,
                        "劍之輝石": 0.15,
                        "弓之輝石": 0.05,
                        "槍之輝石": 0.05,
                        "槍之秘石": 0.08,
                        "槍階銀棋": 0.2,
                        "槍階金像": 0.08
                    },
                    "AP": 17
                }
            },
            "丹佛": {
                "里高之城": {
                    "drop": {
                        "虛影之塵": 0.12,
                        "無間齒輪": 0.15,
                        "弓之輝石": 0.24,
                        "弓之魔石": 0.1,
                        "槍之秘石": 0.02,
                        "槍階銀棋": 0.1,
                        "槍階金像": 0.02
                    },
                    "AP": 17
                }
            },
            "德明": {
                "新芝加哥": {
                    "drop": {
                        "龍之牙": 0.6,
                        "騎之輝石": 0.39,
                        "騎之魔石": 0.05
                    },
                    "AP": 17
                }
            },
            "拉伯克": {
                "德州騎警": {
                    "drop": {
                        "英雄之證": 0.54,
                        "黑獸脂": 0.12,
                        "劍之輝石": 0.2,
                        "弓之輝石": 0.1,
                        "殺之魔石": 0.08
                    },
                    "AP": 18
                }
            },
            "達拉斯": {
                "牛鎮體育館": {
                    "drop": {
                        "英雄之證": 0.66,
                        "弓之輝石": 0.1,
                        "槍之輝石": 0.25
                    },
                    "AP": 18
                }
            },
            "亞力山德里亞": {
                "威克斯島": {
                    "drop": {
                        "英雄之證": 0.54,
                        "血之淚石": 0.12,
                        "劍之輝石": 0.15,
                        "弓之輝石": 0.05,
                        "弓之魔石": 0.08,
                        "槍之輝石": 0.1
                    },
                    "AP": 18
                }
            },
            "阿爾卡特拉斯島": {
                "監獄島": {
                    "drop": {
                        "英雄之證": 0.54,
                        "虛影之塵": 0.12,
                        "劍之輝石": 0.05,
                        "槍之輝石": 0.25,
                        "狂階銀棋": 0.1,
                        "狂階金像": 0.02
                    },
                    "AP": 18
                }
            },
            "得梅因": {
                "監視據點": {
                    "drop": {
                        "虛影之塵": 0.16,
                        "世界樹之種": 0.09,
                        "混沌之爪": 0.2,
                        "槍之秘石": 0.04,
                        "殺之魔石": 0.09,
                        "狂之魔石": 0.08,
                        "槍階銀棋": 0.1,
                        "槍階金像": 0.04
                    },
                    "AP": 18
                }
            },
            "卡尼": {
                "大平原": {
                    "drop": {
                        "英雄之證": 0.54,
                        "戰馬的幼角": 0.12,
                        "劍之輝石": 0.15,
                        "槍之輝石": 0.15,
                        "槍之魔石": 0.08
                    },
                    "AP": 18
                }
            },
            "蒙哥馬利": {
                "南國醫戀(Hart of Dixie)": {
                    "drop": {
                        "英雄之證": 0.63,
                        "虛影之塵": 0.16,
                        "弓之輝石": 0.3,
                        "弓階銀棋": 0.1,
                        "弓階金像": 0.04
                    },
                    "AP": 18
                }
            },
            "夏洛特": {
                "掏金熱": {
                    "drop": {
                        "英雄之證": 0.48,
                        "虛影之塵": 0.64,
                        "弓之輝石": 0.1,
                        "槍之輝石": 0.1,
                        "槍之秘石": 0.04,
                        "術之輝石": 0.05,
                        "槍階銀棋": 0.1,
                        "狂階銀棋": 0.3,
                        "槍階金像": 0.04,
                        "狂階金像": 0.12
                    },
                    "AP": 20
                }
            },
            "華盛頓": {
                "特別行政區": {
                    "drop": {
                        "英雄之證": 0.54,
                        "精靈根": 0.08,
                        "劍之輝石": 0.15,
                        "劍之秘石": 0.03,
                        "弓之輝石": 0.05,
                        "槍之輝石": 0.05,
                        "術之輝石": 0.05
                    },
                    "AP": 20
                }
            },
            "芝加哥": {
                "風之城": {
                    "drop": {
                        "無間齒輪": 0.4,
                        "弓之輝石": 0.24,
                        "弓之魔石": 0.15,
                        "弓之秘石": 0.03
                    },
                    "AP": 21
                }
            }
        },
        "第六特異點": {
            "沙塵暴的沙漠": {
                "神獸之庭": {
                    "drop": {
                        "兇骨": 0.63,
                        "智慧之聖甲蟲像": 0.08,
                        "劍之輝石": 0.1,
                        "弓之輝石": 0.1,
                        "槍之輝石": 0.1,
                        "術之秘石": 0.03
                    },
                    "AP": 19
                }
            },
            "黎明的沙丘": {
                "灼熱之巔": {
                    "drop": {
                        "蛇之寶玉": 0.15,
                        "封魔之燈": 0.12,
                        "術之輝石": 0.15,
                        "術之魔石": 0.47
                    },
                    "AP": 19
                }
            },
            "死之荒野": {
                "熱血沸騰的狂宴": {
                    "drop": {
                        "愚者之鎖": 0.66,
                        "殺之輝石": 0.2,
                        "狂之輝石": 0.15
                    },
                    "AP": 19
                }
            },
            "東之村": {
                "已然枯萎的山脊": {
                    "drop": {
                        "龍之牙": 0.42,
                        "戰馬的幼角": 0.16,
                        "槍之魔石": 0.08
                    },
                    "AP": 19
                }
            },
            "圓桌要塞": {
                "游擊騎士隊": {
                    "drop": {
                        "英雄之證": 0.45,
                        "大騎士勳章": 0.187,
                        "劍之輝石": 0.1,
                        "劍之魔石": 0.1,
                        "槍之輝石": 0.15,
                        "槍之魔石": 0.1
                    },
                    "AP": 19
                }
            },
            "晚鐘廟": {
                "宣告死亡的天使": {
                    "drop": {
                        "鬼魂提燈": 0.31,
                        "殺之輝石": 0.47,
                        "殺之魔石": 0.02
                    },
                    "AP": 19
                }
            },
            "西之村遺跡": {
                "無情的殘影": {
                    "drop": {
                        "虛影之塵": 0.458,
                        "殺之輝石": 0.48,
                        "殺階銀棋": 0.1,
                        "殺階金像": 0.04
                    },
                    "AP": 20
                }
            },
            "阿特拉斯院": {
                "巨人的地窖": {
                    "drop": {
                        "無間齒輪": 0.217,
                        "禁斷書頁": 0.09,
                        "弓之輝石": 0.15,
                        "術之魔石": 0.08,
                        "殺之輝石": 0.1
                    },
                    "AP": 20
                }
            },
            "隱密之村": {
                "夢幻的海市蜃樓": {
                    "drop": {
                        "愚者之鎖": 0.315,
                        "封魔之燈": 0.16,
                        "術之魔石": 0.08,
                        "殺之輝石": 0.1,
                        "狂之輝石": 0.05
                    },
                    "AP": 21
                }
            },
            "大神殿": {
                "太陽王的居城": {
                    "drop": {
                        "愚者之鎖": 0.42,
                        "智慧之聖甲蟲像": 0.12,
                        "術之秘石": 0.06,
                        "殺之輝石": 0.05,
                        "狂之輝石": 0.15
                    },
                    "AP": 22
                }
            },
            "聖都正門": {
                "祝聖之門": {
                    "drop": {
                        "大騎士勳章": 0.3,
                        "劍之魔石": 0.1,
                        "弓之魔石": 0.05,
                        "槍之魔石": 0.1
                    },
                    "AP": 20
                }
            },
            "聖都市街": {
                "理想都市": {
                    "drop": {
                        "英雄之證": 0.36,
                        "八連雙晶": 0.27,
                        "精靈根": 0.12,
                        "劍之輝石": 0.05,
                        "劍之秘石": 0.03,
                        "槍之輝石": 0.1,
                        "狂之秘石": 0.09
                    },
                    "AP": 20
                }
            },
            "王城": {
                "千年王國": {
                    "drop": {
                        "虛影之塵": 0.16,
                        "大騎士勳章": 0.35,
                        "劍之魔石": 0.25,
                        "劍階銀棋": 0.1,
                        "劍階金像": 0.04
                    },
                    "AP": 21
                }
            },
            "無之大地": {
                "荒涼世界": {
                    "drop": {
                        "隕蹄鐵": 0.45,
                        "弓之輝石": 0.08,
                        "弓之秘石": 0.03,
                        "騎之輝石": 0.16,
                        "騎之魔石": 0.05,
                        "騎之秘石": 0.06,
                        "殺之魔石": 0.05
                    },
                    "AP": 22
                }
            }
        }
    };
    var all_quest_list = {};
    //all_quest_list
    JIE.base.margeDeep(all_quest_list, every_data_quest_list);
    JIE.base.margeDeep(all_quest_list, free_quest_list);

    var item_list = {
        chess_and_stone: {
            class_list: ["劍", "弓", "槍", "騎", "術", "殺", "狂"],
            name_list: ["之輝石", "之魔石", "之秘石", "階銀棋", "階金像"],
        },
        other_items: {
            copper: ["英雄之證", "兇骨", "龍之牙", "虛影之塵", "愚者之鎖"],
            silver: ["世界樹之種", "鬼魂提燈", "八連雙晶", "蛇之寶玉", "鳳凰羽毛", "無間齒輪", "禁斷書頁", "人工生命體幼體", "隕蹄鐵", "大騎士勳章", "追憶的貝殼"],
            gold: ["混沌之爪", "蠻神心臟", "龍之逆鱗", "精靈根", "戰馬的幼角", "血之淚石", "黑獸脂", "封魔之燈", "智慧之聖甲蟲像"]
        }
    };

    var item2quest_list = get_item2quest_list();




    function get_item2quest_list() {
        var list = {},
            type1, type2, type3, item, quest;
        //all_quest_list = [every_data_quest_list, free_quest];

        //get the list
        for (type1 in all_quest_list) {
            for (type2 in all_quest_list[type1]) {
                for (type3 in all_quest_list[type1][type2]) {
                    quest = all_quest_list[type1][type2][type3];
                    for (item in quest.drop) {
                        if (list[item] === undefined) list[item] = [];
                        list[item].push({
                            type: [type1, type2, type3],
                            CP: quest.drop[item] / quest.AP
                        });
                    }
                }
            }
        }
        //sort
        for (item in list) {
            list[item].sort(function (a, b) {
                if (a.CP > b.CP) return -1;
                else if (a.CP < b.CP) return 1;
                else return 0;
            });
        }
        return list;
    }

    function filter_quest(filter_list) {
        if (filter_list === undefined) return [];

        var list = [],
            filter_quest_list = filter_list.quest_list || [],
            filter_item_list = filter_list.item_list || [],
            i, i_max;

        var type1, type2, type3, item, quest, passed;

        //create list
        for (type1 in all_quest_list) {
            if (filter_quest_list[type1] === undefined) continue;
            for (type2 in all_quest_list[type1]) {
                for (type3 in all_quest_list[type1][type2]) {
                    quest = all_quest_list[type1][type2][type3];
                    passed = false;
                    for (item in filter_quest_list) {
                        if (quest.drop[item]) {
                            passed = true;
                            break;
                        }
                    }
                    if (passed) {
                        list.push({ type: [type1, type2, type3] });
                    }
                }
            }
        }

        //計算有幾樣目標道具
        for (i = 0, i_max = list.length; i < i_max; i++) {
            list[i].kind = 0;
            quest = all_quest_list[list[i].type[0]][list[i].type[1]][list[i].type[2]];

            for (item in filter_item_list) {
                if (quest.drop[item]) list[i].kind += 1;
            }
        }


        return list;
    }

    function filter_item(filter_list) {
        if (filter_list === undefined) return [];

        var list = {}, copy_list = {}, used_quest,
            filter_quest_list = filter_list.quest_list || [],
            filter_item_list = filter_list.item_list || [],
            target_item, index, i, i_max, type1, quest,
            item, j, win, boss_cp, target_cp;

        var target, boss, tmp;
        var finish_item = {};

        for (index in filter_item_list) {
            target_item = filter_item_list[index];
            if (list[target_item] === undefined) list[target_item] = [];
            for (i = 0, i_max = item2quest_list[target_item].length; i < i_max; i++) {
                type1 = item2quest_list[target_item][i].type[0];

                if (!JIE.array.includes(type1, filter_quest_list)) continue;

                if (list[target_item].length === 0) {
                    list[target_item].push(item2quest_list[target_item][i]);
                } else {
                    tmp = list[target_item][list[target_item].length - 1];
                    boss = all_quest_list[tmp.type[0]][tmp.type[1]][tmp.type[2]];

                    tmp = item2quest_list[target_item][i];
                    target = all_quest_list[tmp.type[0]][tmp.type[1]][tmp.type[2]];

                    if (target === boss) continue;

                    win = false;
                    for (item in boss.drop) {
                        if (!JIE.array.includes(item, filter_item_list)) continue;
                        if (finish_item[item]) continue;
                        boss_cp = boss.drop[item] / boss.AP;
                        target_cp = target.drop[item] / target.AP;
                        if (target_cp > boss_cp) {
                            win = true;
                            break;
                        }
                    }
                    if (win) {
                        list[target_item].push(item2quest_list[target_item][i]);
                    }
                }

                finish_item[target_item] = 1;
            }
        }

        JIE.base.extendDeep(copy_list, list);

        return copy_list;
    }

    function transform_item2quest(item2quest_list) {
        var list_arr = [], list_obj = {};
        var item, index, type, source_type, target_type;
        var i, j, k;
        for (item in item2quest_list) {
            for (index in item2quest_list[item]) {
                type = item2quest_list[item][index].type;
                if (list_obj[type[0]] === undefined) list_obj[type[0]] = {};
                if (list_obj[type[0]][type[1]] === undefined) list_obj[type[0]][type[1]] = {};
                if (list_obj[type[0]][type[1]][type[2]] === undefined) list_obj[type[0]][type[1]][type[2]] = 0;
                list_obj[type[0]][type[1]][type[2]] += 1;
            }
        }
        for (i in list_obj) {
            for (j in list_obj[i]) {
                for (k in list_obj[i][j]) {
                    list_arr.push({
                        type: [i, j, k],
                        target_item_count: list_obj[i][j][k]
                    });
                }
            }
        }
        list_arr.sort(function (q_1, q_2) {
            return q_2.target_item_count - q_1.target_item_count;
        });

        return list_arr;
    }

    return {
        get_schedule: function () {
            var list = [];
            JIE.base.extend(list, schedule_list);
            return list;
        },
        get_every_data_quest_list: function () {
            var list = {};
            JIE.base.extendDeep(list, every_data_quest_list);
            return list;
        },
        get_free_quest_list: function () {
            var list = {};
            JIE.base.extendDeep(list, free_quest_list);
            return list;
        },
        get_all_quest_list: function () {
            list = {};
            JIE.base.extendDeep(list, all_quest_list);
            return list;
        },
        /* 
         * 用於獲得塞選後的關卡
         * filter_list = {
         *  schedule: ["每日任務", "特異點F", "第一特異點"],     //開放的關卡
         *  item: ["英雄之證", "混沌之爪"]                      //目標道具
         * }
         * 
         * return [{type: [type1, type2, type3], kind: 3}, ...]
         * 
         * @method get_quest_list_by_filter
         * @param   {Object} filter_list 其key包含schedule & item
         * @return  {Array}  過濾後的矩陣清單, 需查表解析
         */
        get_quest_list_by_filter: function (filter_list) {
            return filter_quest(filter_list);
        },
        get_item_list: function () {
            var list = {};
            JIE.base.extendDeep(list, item_list);
            return list;
        },
        get_item2quest_list: function () {
            var list = {};
            JIE.base.extendDeep(list, item2quest_list);
            return list;
        },
        /* 
         * 用於獲得塞選後的道具對應關卡資訊
         * filter_list = {
         *  schedule: ["每日任務", "特異點F", "第一特異點"],     //開放的關卡
         *  item: ["英雄之證", "混沌之爪"]                      //目標道具
         * }
         * 
         * return: {
         *  "英雄之證": [{
         *                  type: [type1, type2, type3],
         *                  CP: quest.drop[item] / quest.AP
         *              },
         *              ...],
         * ...
         * }
         * 
         * @method get_item2quest_list_by_filter
         * @param   {Object} filter_list 其key包含schedule & item
         * @return  {Array}  過濾後的矩陣清單, 需查表解析
         */
        get_item2quest_list_by_filter: function (filter_list) {
            return filter_item(filter_list);
        },
        transform_item2quest: function (item2quest_list) {
            return transform_item2quest(item2quest_list);
        }
    };
};